trol73/avr-make/asm/include/ATxmega32E5def.inc
;***** THIS IS A MACHINE GENERATED FILE - DO NOT EDIT ********************

;*************************************************************************
;* A P P L I C A T I O N   N O T E   F O R   T H E   A V R   F A M I L Y
;* 
;* Number            : AVR000
;* File Name         : ATxmega32E5def.inc
;* Title             : Register/Bit Definitions for the ATxmega32E5
;* Created           : 2012-11-02 13:32
;* Version           : 1.00
;* Support e-mail    : avr@atmel.com
;* Target MCU        : ATxmega32E5
;* 
;* DESCRIPTION
;* When including this file in the assembly program file, all I/O register 
;* names and I/O register bit names appearing in the data book can be used.
;* In addition, the six registers forming the three data pointers X, Y and 
;* Z have been assigned names XL - ZH. Highest RAM address for Internal 
;* SRAM is also defined 
;* 
;*************************************************************************

#ifndef _ATXMEGA32E5DEF_INC_
#define _ATXMEGA32E5DEF_INC_


#pragma partinc 0

; ***** SPECIFY DEVICE ***************************************************
.device	ATxmega32E5

#pragma AVRPART ADMIN PART_NAME ATxmega32E5

.equ	SIGNATURE_000	= 0x1E
.equ	SIGNATURE_001	= 0x95
.equ	SIGNATURE_002	= 0x4C

#pragma AVRPART CORE CORE_VERSION V3X


; ***** ABSOLUTE I/O REGISTER LOCATIONS **********************************


;*************************************************************************
;** GPIO - General Purpose IO
;*************************************************************************

.equ GPIO_GPIOR0 = 0		// General Purpose IO Register 0
.equ GPIO_GPIOR1 = 1		// General Purpose IO Register 1
.equ GPIO_GPIOR2 = 2		// General Purpose IO Register 2
.equ GPIO_GPIOR3 = 3		// General Purpose IO Register 3

;*************************************************************************
;** VPORT0 - Virtual Ports
;*************************************************************************

.equ VPORT0_DIR = 16		// I/O Port Data Direction
.equ VPORT0_OUT = 17		// I/O Port Output
.equ VPORT0_IN = 18		// I/O Port Input
.equ VPORT0_INTFLAGS = 19		// Interrupt Flag Register

;*************************************************************************
;** VPORT1 - Virtual Ports
;*************************************************************************

.equ VPORT1_DIR = 20		// I/O Port Data Direction
.equ VPORT1_OUT = 21		// I/O Port Output
.equ VPORT1_IN = 22		// I/O Port Input
.equ VPORT1_INTFLAGS = 23		// Interrupt Flag Register

;*************************************************************************
;** VPORT2 - Virtual Ports
;*************************************************************************

.equ VPORT2_DIR = 24		// I/O Port Data Direction
.equ VPORT2_OUT = 25		// I/O Port Output
.equ VPORT2_IN = 26		// I/O Port Input
.equ VPORT2_INTFLAGS = 27		// Interrupt Flag Register

;*************************************************************************
;** VPORT3 - Virtual Ports
;*************************************************************************

.equ VPORT3_DIR = 28		// I/O Port Data Direction
.equ VPORT3_OUT = 29		// I/O Port Output
.equ VPORT3_IN = 30		// I/O Port Input
.equ VPORT3_INTFLAGS = 31		// Interrupt Flag Register

;*************************************************************************
;** OCD - On-Chip Debug System
;*************************************************************************

.equ OCD_OCDR0 = 46		// OCD Register 0
.equ OCD_OCDR1 = 47		// OCD Register 1

;*************************************************************************
;** CPU - CPU
;*************************************************************************

.equ CPU_CCP = 52		// Configuration Change Protection
.equ CPU_RAMPD = 56		// Ramp D
.equ CPU_RAMPX = 57		// Ramp X
.equ CPU_RAMPY = 58		// Ramp Y
.equ CPU_RAMPZ = 59		// Ramp Z
.equ CPU_EIND = 60		// Extended Indirect Jump
.equ CPU_SPL = 61		// Stack Pointer Low
.equ CPU_SPH = 62		// Stack Pointer High
.equ CPU_SREG = 63		// Status Register

;*************************************************************************
;** CLK - Clock System
;*************************************************************************

.equ CLK_CTRL = 64		// Control Register
.equ CLK_PSCTRL = 65		// Prescaler Control Register
.equ CLK_LOCK = 66		// Lock register
.equ CLK_RTCCTRL = 67		// RTC Control Register

;*************************************************************************
;** PR - Clock System
;*************************************************************************

.equ PR_PRGEN = 112		// General Power Reduction
.equ PR_PRPA = 113		// Power Reduction Port A
.equ PR_PRPC = 115		// Power Reduction Port C
.equ PR_PRPD = 116		// Power Reduction Port D

;*************************************************************************
;** SLEEP - Sleep Controller
;*************************************************************************

.equ SLEEP_CTRL = 72		// Control Register

;*************************************************************************
;** OSC - Oscillator
;*************************************************************************

.equ OSC_CTRL = 80		// Control Register
.equ OSC_STATUS = 81		// Status Register
.equ OSC_XOSCCTRL = 82		// External Oscillator Control Register
.equ OSC_XOSCFAIL = 83		// Oscillator Failure Detection Register
.equ OSC_RC32KCAL = 84		// 32.768 kHz Internal Oscillator Calibration Register
.equ OSC_PLLCTRL = 85		// PLL Control Register
.equ OSC_DFLLCTRL = 86		// DFLL Control Register
.equ OSC_RC8MCAL = 87		// Internal 8 MHz RC Oscillator Calibration Register

;*************************************************************************
;** DFLLRC32M - DFLL
;*************************************************************************

.equ DFLLRC32M_CTRL = 96		// Control Register
.equ DFLLRC32M_CALA = 98		// Calibration Register A
.equ DFLLRC32M_CALB = 99		// Calibration Register B
.equ DFLLRC32M_COMP0 = 100		// Oscillator Compare Register 0
.equ DFLLRC32M_COMP1 = 101		// Oscillator Compare Register 1
.equ DFLLRC32M_COMP2 = 102		// Oscillator Compare Register 2

;*************************************************************************
;** RST - Reset
;*************************************************************************

.equ RST_STATUS = 120		// Status Register
.equ RST_CTRL = 121		// Control Register

;*************************************************************************
;** WDT - Watch-Dog Timer
;*************************************************************************

.equ WDT_CTRL = 128		// Control
.equ WDT_WINCTRL = 129		// Windowed Mode Control
.equ WDT_STATUS = 130		// Status

;*************************************************************************
;** MCU - MCU Control
;*************************************************************************

.equ MCU_DEVID0 = 144		// Device ID byte 0
.equ MCU_DEVID1 = 145		// Device ID byte 1
.equ MCU_DEVID2 = 146		// Device ID byte 2
.equ MCU_REVID = 147		// Revision ID
.equ MCU_ANAINIT = 151		// Analog Startup Delay
.equ MCU_EVSYSLOCK = 152		// Event System Lock
.equ MCU_WEXLOCK = 153		// WEX Lock
.equ MCU_FAULTLOCK = 154		// FAULT Lock

;*************************************************************************
;** PMIC - Programmable Multi-level Interrupt Controller
;*************************************************************************

.equ PMIC_STATUS = 160		// Status Register
.equ PMIC_INTPRI = 161		// Interrupt Priority
.equ PMIC_CTRL = 162		// Control Register

;*************************************************************************
;** PORTCFG - Port Configuration
;*************************************************************************

.equ PORTCFG_MPCMASK = 176		// Multi-pin Configuration Mask
.equ PORTCFG_CLKOUT = 180		// Clock Out Register
.equ PORTCFG_ACEVOUT = 182		// Analog Comparator and Event Out Register
.equ PORTCFG_SRLCTRL  = 183		// Slew Rate Limit Control Register

;*************************************************************************
;** CRC - Cyclic Redundancy Checker
;*************************************************************************

.equ CRC_CTRL = 208		// Control Register
.equ CRC_STATUS = 209		// Status Register
.equ CRC_DATAIN = 211		// Data Input
.equ CRC_CHECKSUM0 = 212		// Checksum byte 0
.equ CRC_CHECKSUM1 = 213		// Checksum byte 1
.equ CRC_CHECKSUM2 = 214		// Checksum byte 2
.equ CRC_CHECKSUM3 = 215		// Checksum byte 3

;*************************************************************************
;** EDMA - Enhanced DMA Controller
;*************************************************************************

.equ EDMA_CTRL = 256		// Control
.equ EDMA_INTFLAGS = 259		// Transfer Interrupt Status
.equ EDMA_STATUS = 260		// Status
.equ EDMA_TEMP = 262		// Temporary Register For 16-bit Access
.equ EDMA_CH0_CTRLA = 272		// Channel Control A
.equ EDMA_CH0_CTRLB = 273		// Channel Control
.equ EDMA_CH0_ADDRCTRL = 274		// Memory Address Control for Peripheral Ch., or Source Address Control for Standard Ch.
.equ EDMA_CH0_DESTADDRCTRL = 275		// Destination Address Control for Standard Channels Only.
.equ EDMA_CH0_TRIGSRC = 276		// Channel Trigger Source
.equ EDMA_CH0_TRFCNTL = 278		// Channel Block Transfer Count for Peripheral Ch., or Channel Block Transfer Count Low for Standard Ch.
.equ EDMA_CH0_TRFCNTH = 279		// Channel Block Transfer Count High for Standard Channels Only
.equ EDMA_CH0_ADDRL = 280		// Channel Memory Address Low for Peripheral Ch., or Channel Source Address Low for Standard Ch.
.equ EDMA_CH0_ADDRH = 281		// Channel Memory Address High for Peripheral Ch., or Channel Source Address High for Standard Ch.
.equ EDMA_CH0_DESTADDRL = 284		// Channel Destination Address High for Standard Channels Only.
.equ EDMA_CH0_DESTADDRH = 285		// Channel Destination Address High for Standard Channels Only.
.equ EDMA_CH1_CTRLA = 288		// Channel Control A
.equ EDMA_CH1_CTRLB = 289		// Channel Control
.equ EDMA_CH1_ADDRCTRL = 290		// Memory Address Control for Peripheral Ch., or Source Address Control for Standard Ch.
.equ EDMA_CH1_DESTADDRCTRL = 291		// Destination Address Control for Standard Channels Only.
.equ EDMA_CH1_TRIGSRC = 292		// Channel Trigger Source
.equ EDMA_CH1_TRFCNTL = 294		// Channel Block Transfer Count for Peripheral Ch., or Channel Block Transfer Count Low for Standard Ch.
.equ EDMA_CH1_TRFCNTH = 295		// Channel Block Transfer Count High for Standard Channels Only
.equ EDMA_CH1_ADDRL = 296		// Channel Memory Address Low for Peripheral Ch., or Channel Source Address Low for Standard Ch.
.equ EDMA_CH1_ADDRH = 297		// Channel Memory Address High for Peripheral Ch., or Channel Source Address High for Standard Ch.
.equ EDMA_CH1_DESTADDRL = 300		// Channel Destination Address High for Standard Channels Only.
.equ EDMA_CH1_DESTADDRH = 301		// Channel Destination Address High for Standard Channels Only.
.equ EDMA_CH2_CTRLA = 304		// Channel Control A
.equ EDMA_CH2_CTRLB = 305		// Channel Control
.equ EDMA_CH2_ADDRCTRL = 306		// Memory Address Control for Peripheral Ch., or Source Address Control for Standard Ch.
.equ EDMA_CH2_DESTADDRCTRL = 307		// Destination Address Control for Standard Channels Only.
.equ EDMA_CH2_TRIGSRC = 308		// Channel Trigger Source
.equ EDMA_CH2_TRFCNTL = 310		// Channel Block Transfer Count for Peripheral Ch., or Channel Block Transfer Count Low for Standard Ch.
.equ EDMA_CH2_TRFCNTH = 311		// Channel Block Transfer Count High for Standard Channels Only
.equ EDMA_CH2_ADDRL = 312		// Channel Memory Address Low for Peripheral Ch., or Channel Source Address Low for Standard Ch.
.equ EDMA_CH2_ADDRH = 313		// Channel Memory Address High for Peripheral Ch., or Channel Source Address High for Standard Ch.
.equ EDMA_CH2_DESTADDRL = 316		// Channel Destination Address High for Standard Channels Only.
.equ EDMA_CH2_DESTADDRH = 317		// Channel Destination Address High for Standard Channels Only.
.equ EDMA_CH3_CTRLA = 320		// Channel Control A
.equ EDMA_CH3_CTRLB = 321		// Channel Control
.equ EDMA_CH3_ADDRCTRL = 322		// Memory Address Control for Peripheral Ch., or Source Address Control for Standard Ch.
.equ EDMA_CH3_DESTADDRCTRL = 323		// Destination Address Control for Standard Channels Only.
.equ EDMA_CH3_TRIGSRC = 324		// Channel Trigger Source
.equ EDMA_CH3_TRFCNTL = 326		// Channel Block Transfer Count for Peripheral Ch., or Channel Block Transfer Count Low for Standard Ch.
.equ EDMA_CH3_TRFCNTH = 327		// Channel Block Transfer Count High for Standard Channels Only
.equ EDMA_CH3_ADDRL = 328		// Channel Memory Address Low for Peripheral Ch., or Channel Source Address Low for Standard Ch.
.equ EDMA_CH3_ADDRH = 329		// Channel Memory Address High for Peripheral Ch., or Channel Source Address High for Standard Ch.
.equ EDMA_CH3_DESTADDRL = 332		// Channel Destination Address High for Standard Channels Only.
.equ EDMA_CH3_DESTADDRH = 333		// Channel Destination Address High for Standard Channels Only.

;*************************************************************************
;** EVSYS - Event System
;*************************************************************************

.equ EVSYS_CH0MUX = 384		// Event Channel 0 Multiplexer
.equ EVSYS_CH1MUX = 385		// Event Channel 1 Multiplexer
.equ EVSYS_CH2MUX = 386		// Event Channel 2 Multiplexer
.equ EVSYS_CH3MUX = 387		// Event Channel 3 Multiplexer
.equ EVSYS_CH4MUX = 388		// Event Channel 4 Multiplexer
.equ EVSYS_CH5MUX = 389		// Event Channel 5 Multiplexer
.equ EVSYS_CH6MUX = 390		// Event Channel 6 Multiplexer
.equ EVSYS_CH7MUX = 391		// Event Channel 7 Multiplexer
.equ EVSYS_CH0CTRL = 392		// Channel 0 Control Register
.equ EVSYS_CH1CTRL = 393		// Channel 1 Control Register
.equ EVSYS_CH2CTRL = 394		// Channel 2 Control Register
.equ EVSYS_CH3CTRL = 395		// Channel 3 Control Register
.equ EVSYS_CH4CTRL = 396		// Channel 4 Control Register
.equ EVSYS_CH5CTRL = 397		// Channel 5 Control Register
.equ EVSYS_CH6CTRL = 398		// Channel 6 Control Register
.equ EVSYS_CH7CTRL = 399		// Channel 7 Control Register
.equ EVSYS_STROBE = 400		// Event Strobe
.equ EVSYS_DATA = 401		// Event Data
.equ EVSYS_DFCTRL = 402		// Digital Filter Control Register

;*************************************************************************
;** NVM - Non Volatile Memory Controller
;*************************************************************************

.equ NVM_ADDR0 = 448		// Address Register 0
.equ NVM_ADDR1 = 449		// Address Register 1
.equ NVM_ADDR2 = 450		// Address Register 2
.equ NVM_DATA0 = 452		// Data Register 0
.equ NVM_DATA1 = 453		// Data Register 1
.equ NVM_DATA2 = 454		// Data Register 2
.equ NVM_CMD = 458		// Command
.equ NVM_CTRLA = 459		// Control Register A
.equ NVM_CTRLB = 460		// Control Register B
.equ NVM_INTCTRL = 461		// Interrupt Control
.equ NVM_STATUS = 463		// Status
.equ NVM_LOCKBITS = 464		// Lock Bits

;*************************************************************************
;** ADCA - Analog/Digital Converter
;*************************************************************************

.equ ADCA_CTRLA = 512		// Control Register A
.equ ADCA_CTRLB = 513		// Control Register B
.equ ADCA_REFCTRL = 514		// Reference Control
.equ ADCA_EVCTRL = 515		// Event Control
.equ ADCA_PRESCALER = 516		// Clock Prescaler
.equ ADCA_INTFLAGS = 518		// Interrupt Flags
.equ ADCA_TEMP = 519		// Temporary Register
.equ ADCA_SAMPCTRL = 520		// ADC Sampling Time Control Register
.equ ADCA_CAL = 524		// Calibration Value
.equ ADCA_CH0RES = 528		// Channel 0 Result
.equ ADCA_CMP = 536		// Compare Value
.equ ADCA_CH0_CTRL = 544		// Control Register
.equ ADCA_CH0_MUXCTRL = 545		// MUX Control
.equ ADCA_CH0_INTCTRL = 546		// Channel Interrupt Control Register
.equ ADCA_CH0_INTFLAGS = 547		// Interrupt Flags
.equ ADCA_CH0_RES = 548		// Channel Result
.equ ADCA_CH0_SCAN = 550		// Input Channel Scan
.equ ADCA_CH0_CORRCTRL = 551		// Correction Control Register
.equ ADCA_CH0_OFFSETCORR0 = 552		// Offset Correction Register 0
.equ ADCA_CH0_OFFSETCORR1 = 553		// Offset Correction Register 1
.equ ADCA_CH0_GAINCORR0 = 554		// Gain Correction Register 0
.equ ADCA_CH0_GAINCORR1 = 555		// Gain Correction Register 1
.equ ADCA_CH0_AVGCTRL = 556		// Average Control Register

;*************************************************************************
;** DACA - Digital/Analog Converter
;*************************************************************************

