trol73/avr-make/asm/include/ATxmega32E5def.inc
.equ FAULTC5_CTRLA = 2192		// Control A Register
.equ FAULTC5_CTRLB = 2193		// Control B Register
.equ FAULTC5_CTRLC = 2194		// Control C Register
.equ FAULTC5_CTRLD = 2195		// Control D Register
.equ FAULTC5_CTRLE = 2196		// Control E Register
.equ FAULTC5_STATUS = 2197		// Status Register
.equ FAULTC5_CTRLGCLR = 2198		// Control Register G Clear
.equ FAULTC5_CTRLGSET = 2199		// Control Register G set

;*************************************************************************
;** WEXC - Waveform Extension
;*************************************************************************

.equ WEXC_CTRL = 2208		// Control Register
.equ WEXC_DTBOTH = 2209		// Dead-time Concurrent Write to Both Sides Register
.equ WEXC_DTLS = 2210		// Dead-time Low Side Register
.equ WEXC_DTHS = 2211		// Dead-time High Side Register
.equ WEXC_STATUSCLR = 2212		// Status Clear Register
.equ WEXC_STATUSSET = 2213		// Status Set Register
.equ WEXC_SWAP = 2214		// Swap Register
.equ WEXC_PGO = 2215		// Pattern Generation Override Register
.equ WEXC_PGV = 2216		// Pattern Generation Value Register
.equ WEXC_SWAPBUF = 2218		// Dead Time Low Side Buffer
.equ WEXC_PGOBUF = 2219		// Pattern Generation Overwrite Buffer Register
.equ WEXC_PGVBUF = 2220		// Pattern Generation Value Buffer Register
.equ WEXC_OUTOVDIS = 2223		// Output Override Disable Register 

;*************************************************************************
;** HIRESC - High-Resolution Extension
;*************************************************************************

.equ HIRESC_CTRLA = 2224		// Control Register A

;*************************************************************************
;** USARTC0 - Universal Asynchronous Receiver-Transmitter
;*************************************************************************

.equ USARTC0_DATA = 2240		// Data Register
.equ USARTC0_STATUS = 2241		// Status Register
.equ USARTC0_CTRLA = 2242		// Control Register A
.equ USARTC0_CTRLB = 2243		// Control Register B
.equ USARTC0_CTRLC = 2244		// Control Register C
.equ USARTC0_CTRLD = 2245		// Control Register D
.equ USARTC0_BAUDCTRLA = 2246		// Baud Rate Control Register A
.equ USARTC0_BAUDCTRLB = 2247		// Baud Rate Control Register B

;*************************************************************************
;** USARTD0 - Universal Asynchronous Receiver-Transmitter
;*************************************************************************

.equ USARTD0_DATA = 2496		// Data Register
.equ USARTD0_STATUS = 2497		// Status Register
.equ USARTD0_CTRLA = 2498		// Control Register A
.equ USARTD0_CTRLB = 2499		// Control Register B
.equ USARTD0_CTRLC = 2500		// Control Register C
.equ USARTD0_CTRLD = 2501		// Control Register D
.equ USARTD0_BAUDCTRLA = 2502		// Baud Rate Control Register A
.equ USARTD0_BAUDCTRLB = 2503		// Baud Rate Control Register B

;*************************************************************************
;** SPIC - Serial Peripheral Interface
;*************************************************************************

.equ SPIC_CTRL = 2272		// Control Register
.equ SPIC_INTCTRL = 2273		// Interrupt Control Register
.equ SPIC_STATUS = 2274		// Status Register
.equ SPIC_DATA = 2275		// Data Register
.equ SPIC_CTRLB = 2276		// Control Register B

;*************************************************************************
;** IRCOM - IR Communication Module
;*************************************************************************

.equ IRCOM_CTRL = 2296		// Control Register
.equ IRCOM_TXPLCTRL = 2297		// IrDA Transmitter Pulse Length Control Register
.equ IRCOM_RXPLCTRL = 2298		// IrDA Receiver Pulse Length Control Register


; ***** ALL MODULE BASE ADRESSES *****************************************

.equ GPIO_base = 0x0000		// General Purpose IO
.equ VPORT0_base = 0x0010		// Virtual Ports
.equ VPORT1_base = 0x0014		// Virtual Ports
.equ VPORT2_base = 0x0018		// Virtual Ports
.equ VPORT3_base = 0x001C		// Virtual Ports
.equ OCD_base = 0x002E		// On-Chip Debug System
.equ CPU_base = 0x0030		// CPU
.equ CLK_base = 0x0040		// Clock System
.equ PR_base = 0x0070		// Clock System
.equ SLEEP_base = 0x0048		// Sleep Controller
.equ OSC_base = 0x0050		// Oscillator
.equ DFLLRC32M_base = 0x0060		// DFLL
.equ RST_base = 0x0078		// Reset
.equ WDT_base = 0x0080		// Watch-Dog Timer
.equ MCU_base = 0x0090		// MCU Control
.equ PMIC_base = 0x00A0		// Programmable Multi-level Interrupt Controller
.equ PORTCFG_base = 0x00B0		// Port Configuration
.equ CRC_base = 0x00D0		// Cyclic Redundancy Checker
.equ EDMA_base = 0x0100		// Enhanced DMA Controller
.equ EVSYS_base = 0x0180		// Event System
.equ NVM_base = 0x01C0		// Non Volatile Memory Controller
.equ ADCA_base = 0x0200		// Analog/Digital Converter
.equ DACA_base = 0x0300		// Digital/Analog Converter
.equ ACA_base = 0x0380		// Analog Comparator
.equ RTC_base = 0x0400		// Real-Time Clounter
.equ XCL_base = 0x0460		// XMEGA Custom Logic
.equ TWIC_base = 0x0480		// Two-Wire Interface
.equ PORTA_base = 0x0600		// Port Configuration
.equ PORTC_base = 0x0640		// Port Configuration
.equ PORTD_base = 0x0660		// Port Configuration
.equ PORTR_base = 0x07E0		// Port Configuration
.equ TCC4_base = 0x0800		// 16-bit Timer/Counter With PWM
.equ TCC5_base = 0x0840		// 16-bit Timer/Counter With PWM
.equ TCD5_base = 0x0940		// 16-bit Timer/Counter With PWM
.equ FAULTC4_base = 0x0880		// Fault Extension
.equ FAULTC5_base = 0x0890		// Fault Extension
.equ WEXC_base = 0x08A0		// Waveform Extension
.equ HIRESC_base = 0x08B0		// High-Resolution Extension
.equ USARTC0_base = 0x08C0		// Universal Asynchronous Receiver-Transmitter
.equ USARTD0_base = 0x09C0		// Universal Asynchronous Receiver-Transmitter
.equ SPIC_base = 0x08E0		// Serial Peripheral Interface
.equ IRCOM_base = 0x08F8		// IR Communication Module


; ***** IO REGISTER OFFSETS **********************************************


;*************************************************************************
;** GPIO - General Purpose IO
;*************************************************************************
.equ GPIO_GPIOR0_offset = 0x00		// General Purpose IO Register 0
.equ GPIO_GPIOR1_offset = 0x01		// General Purpose IO Register 1
.equ GPIO_GPIOR2_offset = 0x02		// General Purpose IO Register 2
.equ GPIO_GPIOR3_offset = 0x03		// General Purpose IO Register 3

;*************************************************************************
;** VPORT - Virtual Ports
;*************************************************************************
.equ VPORT_DIR_offset = 0x00		// I/O Port Data Direction
.equ VPORT_OUT_offset = 0x01		// I/O Port Output
.equ VPORT_IN_offset = 0x02		// I/O Port Input
.equ VPORT_INTFLAGS_offset = 0x03		// Interrupt Flag Register

;*************************************************************************
;** XOCD - On-Chip Debug System
;*************************************************************************
.equ OCD_OCDR0_offset = 0x00		// OCD Register 0
.equ OCD_OCDR1_offset = 0x01		// OCD Register 1

;*************************************************************************
;** CPU - CPU
;*************************************************************************
.equ CPU_CCP_offset = 0x04		// Configuration Change Protection
.equ CPU_RAMPD_offset = 0x08		// Ramp D
.equ CPU_RAMPX_offset = 0x09		// Ramp X
.equ CPU_RAMPY_offset = 0x0A		// Ramp Y
.equ CPU_RAMPZ_offset = 0x0B		// Ramp Z
.equ CPU_EIND_offset = 0x0C		// Extended Indirect Jump
.equ CPU_SPL_offset = 0x0D		// Stack Pointer Low
.equ CPU_SPH_offset = 0x0E		// Stack Pointer High
.equ CPU_SREG_offset = 0x0F		// Status Register

;*************************************************************************
;** CLK - Clock System
;*************************************************************************
.equ CLK_CTRL_offset = 0x00		// Control Register
.equ CLK_PSCTRL_offset = 0x01		// Prescaler Control Register
.equ CLK_LOCK_offset = 0x02		// Lock register
.equ CLK_RTCCTRL_offset = 0x03		// RTC Control Register
.equ PR_PRGEN_offset = 0x00		// General Power Reduction
.equ PR_PRPA_offset = 0x01		// Power Reduction Port A
.equ PR_PRPC_offset = 0x03		// Power Reduction Port C
.equ PR_PRPD_offset = 0x04		// Power Reduction Port D

;*************************************************************************
;** SLEEP - Sleep Controller
;*************************************************************************
.equ SLEEP_CTRL_offset = 0x00		// Control Register

;*************************************************************************
;** OSC - Oscillator
;*************************************************************************
.equ OSC_CTRL_offset = 0x00		// Control Register
.equ OSC_STATUS_offset = 0x01		// Status Register
.equ OSC_XOSCCTRL_offset = 0x02		// External Oscillator Control Register
.equ OSC_XOSCFAIL_offset = 0x03		// Oscillator Failure Detection Register
.equ OSC_RC32KCAL_offset = 0x04		// 32.768 kHz Internal Oscillator Calibration Register
.equ OSC_PLLCTRL_offset = 0x05		// PLL Control Register
.equ OSC_DFLLCTRL_offset = 0x06		// DFLL Control Register
.equ OSC_RC8MCAL_offset = 0x07		// Internal 8 MHz RC Oscillator Calibration Register

;*************************************************************************
;** DFLL - DFLL
;*************************************************************************
.equ DFLL_CTRL_offset = 0x00		// Control Register
.equ DFLL_CALA_offset = 0x02		// Calibration Register A
.equ DFLL_CALB_offset = 0x03		// Calibration Register B
.equ DFLL_COMP0_offset = 0x04		// Oscillator Compare Register 0
.equ DFLL_COMP1_offset = 0x05		// Oscillator Compare Register 1
.equ DFLL_COMP2_offset = 0x06		// Oscillator Compare Register 2

;*************************************************************************
;** RST - Reset
;*************************************************************************
.equ RST_STATUS_offset = 0x00		// Status Register
.equ RST_CTRL_offset = 0x01		// Control Register

;*************************************************************************
;** WDT - Watch-Dog Timer
;*************************************************************************
.equ WDT_CTRL_offset = 0x00		// Control
.equ WDT_WINCTRL_offset = 0x01		// Windowed Mode Control
.equ WDT_STATUS_offset = 0x02		// Status

;*************************************************************************
;** MCU - MCU Control
;*************************************************************************
.equ MCU_DEVID0_offset = 0x00		// Device ID byte 0
.equ MCU_DEVID1_offset = 0x01		// Device ID byte 1
.equ MCU_DEVID2_offset = 0x02		// Device ID byte 2
.equ MCU_REVID_offset = 0x03		// Revision ID
.equ MCU_ANAINIT_offset = 0x07		// Analog Startup Delay
.equ MCU_EVSYSLOCK_offset = 0x08		// Event System Lock
.equ MCU_WEXLOCK_offset = 0x09		// WEX Lock
.equ MCU_FAULTLOCK_offset = 0x0A		// FAULT Lock

;*************************************************************************
;** PMIC - Programmable Multi-level Interrupt Controller
;*************************************************************************
.equ PMIC_STATUS_offset = 0x00		// Status Register
.equ PMIC_INTPRI_offset = 0x01		// Interrupt Priority
.equ PMIC_CTRL_offset = 0x02		// Control Register

;*************************************************************************
;** PORTCFG - Port Configuration
;*************************************************************************
.equ PORTCFG_MPCMASK_offset = 0x00		// Multi-pin Configuration Mask
.equ PORTCFG_CLKOUT_offset = 0x04		// Clock Out Register
.equ PORTCFG_ACEVOUT_offset = 0x06		// Analog Comparator and Event Out Register
.equ PORTCFG_SRLCTRL_offset = 0x07		// Slew Rate Limit Control Register

;*************************************************************************
;** CRC - Cyclic Redundancy Checker
;*************************************************************************
.equ CRC_CTRL_offset = 0x00		// Control Register
.equ CRC_STATUS_offset = 0x01		// Status Register
.equ CRC_DATAIN_offset = 0x03		// Data Input
.equ CRC_CHECKSUM0_offset = 0x04		// Checksum byte 0
.equ CRC_CHECKSUM1_offset = 0x05		// Checksum byte 1
.equ CRC_CHECKSUM2_offset = 0x06		// Checksum byte 2
.equ CRC_CHECKSUM3_offset = 0x07		// Checksum byte 3

;*************************************************************************
;** EDMA - Enhanced DMA Controller
;*************************************************************************
.equ EDMA_CTRL_offset = 0x00		// Control
.equ EDMA_INTFLAGS_offset = 0x03		// Transfer Interrupt Status
.equ EDMA_STATUS_offset = 0x04		// Status
.equ EDMA_TEMP_offset = 0x06		// Temporary Register For 16-bit Access
.equ EDMA_CH0_offset = 0x10		// EDMA Channel 0
.equ EDMA_CH1_offset = 0x20		// EDMA Channel 1
.equ EDMA_CH2_offset = 0x30		// EDMA Channel 2
.equ EDMA_CH3_offset = 0x40		// EDMA Channel 3
.equ EDMA_CH_CTRLA_offset = 0x00		// Channel Control A
.equ EDMA_CH_CTRLB_offset = 0x01		// Channel Control
.equ EDMA_CH_ADDRCTRL_offset = 0x02		// Memory Address Control for Peripheral Ch., or Source Address Control for Standard Ch.
.equ EDMA_CH_DESTADDRCTRL_offset = 0x03		// Destination Address Control for Standard Channels Only.
.equ EDMA_CH_TRIGSRC_offset = 0x04		// Channel Trigger Source
.equ EDMA_CH_TRFCNTL_offset = 0x06		// Channel Block Transfer Count for Peripheral Ch., or Channel Block Transfer Count Low for Standard Ch.
.equ EDMA_CH_TRFCNTH_offset = 0x07		// Channel Block Transfer Count High for Standard Channels Only
.equ EDMA_CH_ADDRL_offset = 0x08		// Channel Memory Address Low for Peripheral Ch., or Channel Source Address Low for Standard Ch.
.equ EDMA_CH_ADDRH_offset = 0x09		// Channel Memory Address High for Peripheral Ch., or Channel Source Address High for Standard Ch.
.equ EDMA_CH_DESTADDRL_offset = 0x0C		// Channel Destination Address High for Standard Channels Only.
.equ EDMA_CH_DESTADDRH_offset = 0x0D		// Channel Destination Address High for Standard Channels Only.

;*************************************************************************
;** EVSYS - Event System
;*************************************************************************
.equ EVSYS_CH0MUX_offset = 0x00		// Event Channel 0 Multiplexer
.equ EVSYS_CH1MUX_offset = 0x01		// Event Channel 1 Multiplexer
.equ EVSYS_CH2MUX_offset = 0x02		// Event Channel 2 Multiplexer
.equ EVSYS_CH3MUX_offset = 0x03		// Event Channel 3 Multiplexer
.equ EVSYS_CH4MUX_offset = 0x04		// Event Channel 4 Multiplexer
.equ EVSYS_CH5MUX_offset = 0x05		// Event Channel 5 Multiplexer
.equ EVSYS_CH6MUX_offset = 0x06		// Event Channel 6 Multiplexer
.equ EVSYS_CH7MUX_offset = 0x07		// Event Channel 7 Multiplexer
.equ EVSYS_CH0CTRL_offset = 0x08		// Channel 0 Control Register
.equ EVSYS_CH1CTRL_offset = 0x09		// Channel 1 Control Register
.equ EVSYS_CH2CTRL_offset = 0x0A		// Channel 2 Control Register
.equ EVSYS_CH3CTRL_offset = 0x0B		// Channel 3 Control Register
.equ EVSYS_CH4CTRL_offset = 0x0C		// Channel 4 Control Register
.equ EVSYS_CH5CTRL_offset = 0x0D		// Channel 5 Control Register
.equ EVSYS_CH6CTRL_offset = 0x0E		// Channel 6 Control Register
.equ EVSYS_CH7CTRL_offset = 0x0F		// Channel 7 Control Register
.equ EVSYS_STROBE_offset = 0x10		// Event Strobe
.equ EVSYS_DATA_offset = 0x11		// Event Data
.equ EVSYS_DFCTRL_offset = 0x12		// Digital Filter Control Register

;*************************************************************************
;** NVM - Non Volatile Memory Controller
;*************************************************************************
.equ NVM_ADDR0_offset = 0x00		// Address Register 0
.equ NVM_ADDR1_offset = 0x01		// Address Register 1
.equ NVM_ADDR2_offset = 0x02		// Address Register 2
.equ NVM_DATA0_offset = 0x04		// Data Register 0
.equ NVM_DATA1_offset = 0x05		// Data Register 1
.equ NVM_DATA2_offset = 0x06		// Data Register 2
.equ NVM_CMD_offset = 0x0A		// Command
.equ NVM_CTRLA_offset = 0x0B		// Control Register A
.equ NVM_CTRLB_offset = 0x0C		// Control Register B
.equ NVM_INTCTRL_offset = 0x0D		// Interrupt Control
.equ NVM_STATUS_offset = 0x0F		// Status
.equ NVM_LOCKBITS_offset = 0x10		// Lock Bits

;*************************************************************************
;** ADC - Analog/Digital Converter
;*************************************************************************
.equ ADC_CH_CTRL_offset = 0x00		// Control Register
.equ ADC_CH_MUXCTRL_offset = 0x01		// MUX Control
.equ ADC_CH_INTCTRL_offset = 0x02		// Channel Interrupt Control Register
.equ ADC_CH_INTFLAGS_offset = 0x03		// Interrupt Flags
.equ ADC_CH_RES_offset = 0x04		// Channel Result
.equ ADC_CH_SCAN_offset = 0x06		// Input Channel Scan
.equ ADC_CH_CORRCTRL_offset = 0x07		// Correction Control Register
.equ ADC_CH_OFFSETCORR0_offset = 0x08		// Offset Correction Register 0
.equ ADC_CH_OFFSETCORR1_offset = 0x09		// Offset Correction Register 1
.equ ADC_CH_GAINCORR0_offset = 0x0A		// Gain Correction Register 0
.equ ADC_CH_GAINCORR1_offset = 0x0B		// Gain Correction Register 1
.equ ADC_CH_AVGCTRL_offset = 0x0C		// Average Control Register
.equ ADC_CTRLA_offset = 0x00		// Control Register A
.equ ADC_CTRLB_offset = 0x01		// Control Register B
.equ ADC_REFCTRL_offset = 0x02		// Reference Control
.equ ADC_EVCTRL_offset = 0x03		// Event Control
.equ ADC_PRESCALER_offset = 0x04		// Clock Prescaler
.equ ADC_INTFLAGS_offset = 0x06		// Interrupt Flags
.equ ADC_TEMP_offset = 0x07		// Temporary Register
.equ ADC_SAMPCTRL_offset = 0x08		// ADC Sampling Time Control Register
.equ ADC_CAL_offset = 0x0C		// Calibration Value
.equ ADC_CH0RES_offset = 0x10		// Channel 0 Result
.equ ADC_CMP_offset = 0x18		// Compare Value
.equ ADC_CH0_offset = 0x20		// ADC Channel 0

;*************************************************************************
;** DAC - Digital/Analog Converter
;*************************************************************************
.equ DAC_CTRLA_offset = 0x00		// Control Register A
.equ DAC_CTRLB_offset = 0x01		// Control Register B
.equ DAC_CTRLC_offset = 0x02		// Control Register C
.equ DAC_EVCTRL_offset = 0x03		// Event Input Control
.equ DAC_TIMCTRL_offset = 0x04		// Timing Control
.equ DAC_STATUS_offset = 0x05		// Status
.equ DAC_CH0GAINCAL_offset = 0x08		// Gain Calibration
.equ DAC_CH0OFFSETCAL_offset = 0x09		// Offset Calibration
.equ DAC_CH1GAINCAL_offset = 0x0A		// Gain Calibration
.equ DAC_CH1OFFSETCAL_offset = 0x0B		// Offset Calibration
.equ DAC_CH0DATA_offset = 0x18		// Channel 0 Data
.equ DAC_CH1DATA_offset = 0x1A		// Channel 1 Data

;*************************************************************************
;** AC - Analog Comparator
;*************************************************************************
.equ AC_AC0CTRL_offset = 0x00		// Analog Comparator 0 Control
.equ AC_AC1CTRL_offset = 0x01		// Analog Comparator 1 Control
.equ AC_AC0MUXCTRL_offset = 0x02		// Analog Comparator 0 MUX Control
.equ AC_AC1MUXCTRL_offset = 0x03		// Analog Comparator 1 MUX Control
.equ AC_CTRLA_offset = 0x04		// Control Register A
.equ AC_CTRLB_offset = 0x05		// Control Register B
.equ AC_WINCTRL_offset = 0x06		// Window Mode Control
.equ AC_STATUS_offset = 0x07		// Status
.equ AC_CURRCTRL_offset = 0x08		// Current Source Control Register
.equ AC_CURRCALIB_offset = 0x09		// Current Source Calibration Register

;*************************************************************************
;** RTC - Real-Time Clounter
;*************************************************************************
.equ RTC_CTRL_offset = 0x00		// Control Register
.equ RTC_STATUS_offset = 0x01		// Status Register
.equ RTC_INTCTRL_offset = 0x02		// Interrupt Control Register
.equ RTC_INTFLAGS_offset = 0x03		// Interrupt Flags
.equ RTC_TEMP_offset = 0x04		// Temporary register
.equ RTC_CALIB_offset = 0x06		// Calibration Register
.equ RTC_CNT_offset = 0x08		// Count Register
.equ RTC_PER_offset = 0x0A		// Period Register
.equ RTC_COMP_offset = 0x0C		// Compare Register

;*************************************************************************
;** XCL - XMEGA Custom Logic
;*************************************************************************
.equ XCL_CTRLA_offset = 0x00		// Control Register A
.equ XCL_CTRLB_offset = 0x01		// Control Register B
.equ XCL_CTRLC_offset = 0x02		// Control Register C
.equ XCL_CTRLD_offset = 0x03		// Control Register D
.equ XCL_CTRLE_offset = 0x04		// Control Register E
.equ XCL_CTRLF_offset = 0x05		// Control Register F
.equ XCL_CTRLG_offset = 0x06		// Control Register G
.equ XCL_INTCTRL_offset = 0x07		// Interrupt Control Register
.equ XCL_INTFLAGS_offset = 0x08		// Interrupt Flag Register
.equ XCL_PLC_offset = 0x09		// Peripheral Lenght Control Register 
.equ XCL_CNTL_offset = 0x0A		// Counter Register Low
.equ XCL_CNTH_offset = 0x0B		// Counter Register High
.equ XCL_CMPL_offset = 0x0C		// Compare Register Low
.equ XCL_CMPH_offset = 0x0D		// Compare Register High
.equ XCL_PERCAPTL_offset = 0x0E		// Period or Capture Register Low
.equ XCL_PERCAPTH_offset = 0x0F		// Period or Capture Register High

;*************************************************************************
;** TWI - Two-Wire Interface
;*************************************************************************
.equ TWI_CTRL_offset = 0x00		// TWI Common Control Register
.equ TWI_MASTER_offset = 0x01		// TWI master module
.equ TWI_SLAVE_offset = 0x08		// TWI slave module
.equ TWI_MASTER_CTRLA_offset = 0x00		// Control Register A
.equ TWI_MASTER_CTRLB_offset = 0x01		// Control Register B
.equ TWI_MASTER_CTRLC_offset = 0x02		// Control Register C
.equ TWI_MASTER_STATUS_offset = 0x03		// Status Register
.equ TWI_MASTER_BAUD_offset = 0x04		// Baurd Rate Control Register
.equ TWI_MASTER_ADDR_offset = 0x05		// Address Register
.equ TWI_MASTER_DATA_offset = 0x06		// Data Register
.equ TWI_SLAVE_CTRLA_offset = 0x00		// Control Register A
.equ TWI_SLAVE_CTRLB_offset = 0x01		// Control Register B
.equ TWI_SLAVE_STATUS_offset = 0x02		// Status Register
.equ TWI_SLAVE_ADDR_offset = 0x03		// Address Register
.equ TWI_SLAVE_DATA_offset = 0x04		// Data Register
.equ TWI_SLAVE_ADDRMASK_offset = 0x05		// Address Mask Register

;*************************************************************************
;** PORT - Port Configuration
;*************************************************************************
.equ PORT_DIR_offset = 0x00		// I/O Port Data Direction
.equ PORT_DIRSET_offset = 0x01		// I/O Port Data Direction Set
.equ PORT_DIRCLR_offset = 0x02		// I/O Port Data Direction Clear
.equ PORT_DIRTGL_offset = 0x03		// I/O Port Data Direction Toggle
.equ PORT_OUT_offset = 0x04		// I/O Port Output
.equ PORT_OUTSET_offset = 0x05		// I/O Port Output Set
.equ PORT_OUTCLR_offset = 0x06		// I/O Port Output Clear
.equ PORT_OUTTGL_offset = 0x07		// I/O Port Output Toggle
.equ PORT_IN_offset = 0x08		// I/O port Input
.equ PORT_INTCTRL_offset = 0x09		// Interrupt Control Register
.equ PORT_INTMASK_offset = 0x0A		// Port Interrupt Mask
.equ PORT_INTFLAGS_offset = 0x0C		// Interrupt Flag Register
.equ PORT_REMAP_offset = 0x0E		// Pin Remap Register
.equ PORT_PIN0CTRL_offset = 0x10		// Pin 0 Control Register
.equ PORT_PIN1CTRL_offset = 0x11		// Pin 1 Control Register
.equ PORT_PIN2CTRL_offset = 0x12		// Pin 2 Control Register
.equ PORT_PIN3CTRL_offset = 0x13		// Pin 3 Control Register
.equ PORT_PIN4CTRL_offset = 0x14		// Pin 4 Control Register
.equ PORT_PIN5CTRL_offset = 0x15		// Pin 5 Control Register
.equ PORT_PIN6CTRL_offset = 0x16		// Pin 6 Control Register
.equ PORT_PIN7CTRL_offset = 0x17		// Pin 7 Control Register

