trol73/avr-make/asm/include/ATxmega32E5def.inc
; ADC_PRESCALER masks
.equ ADC_PRESCALER_gm = 0x07 ; Clock Prescaler Selection group mask
.equ ADC_PRESCALER_gp = 0 ; Clock Prescaler Selection group position
.equ ADC_PRESCALER0_bm = (1<<0) ; Clock Prescaler Selection bit 0 mask
.equ ADC_PRESCALER0_bp = 0 ; Clock Prescaler Selection bit 0 position
.equ ADC_PRESCALER1_bm = (1<<1) ; Clock Prescaler Selection bit 1 mask
.equ ADC_PRESCALER1_bp = 1 ; Clock Prescaler Selection bit 1 position
.equ ADC_PRESCALER2_bm = (1<<2) ; Clock Prescaler Selection bit 2 mask
.equ ADC_PRESCALER2_bp = 2 ; Clock Prescaler Selection bit 2 position

; ADC_INTFLAGS masks
.equ ADC_CH0IF_bm = 0x01 ; Channel 0 Interrupt Flag bit mask
.equ ADC_CH0IF_bp = 0 ; Channel 0 Interrupt Flag bit position

; ADC_SAMPCTRL masks
.equ ADC_SAMPVAL_gm = 0x3F ; Sampling time control register group mask
.equ ADC_SAMPVAL_gp = 0 ; Sampling time control register group position
.equ ADC_SAMPVAL0_bm = (1<<0) ; Sampling time control register bit 0 mask
.equ ADC_SAMPVAL0_bp = 0 ; Sampling time control register bit 0 position
.equ ADC_SAMPVAL1_bm = (1<<1) ; Sampling time control register bit 1 mask
.equ ADC_SAMPVAL1_bp = 1 ; Sampling time control register bit 1 position
.equ ADC_SAMPVAL2_bm = (1<<2) ; Sampling time control register bit 2 mask
.equ ADC_SAMPVAL2_bp = 2 ; Sampling time control register bit 2 position
.equ ADC_SAMPVAL3_bm = (1<<3) ; Sampling time control register bit 3 mask
.equ ADC_SAMPVAL3_bp = 3 ; Sampling time control register bit 3 position
.equ ADC_SAMPVAL4_bm = (1<<4) ; Sampling time control register bit 4 mask
.equ ADC_SAMPVAL4_bp = 4 ; Sampling time control register bit 4 position
.equ ADC_SAMPVAL5_bm = (1<<5) ; Sampling time control register bit 5 mask
.equ ADC_SAMPVAL5_bp = 5 ; Sampling time control register bit 5 position

; Current Limitation
.equ ADC_CURRLIMIT_NO_gc = (0x00<<5) ; No current limit,     300ksps max sampling rate
.equ ADC_CURRLIMIT_LOW_gc = (0x01<<5) ; Low current limit,    225ksps max sampling rate
.equ ADC_CURRLIMIT_MED_gc = (0x02<<5) ; Medium current limit, 150ksps max sampling rate
.equ ADC_CURRLIMIT_HIGH_gc = (0x03<<5) ; High current limit,   75ksps max sampling rate

; Conversion result resolution
.equ ADC_RESOLUTION_12BIT_gc = (0x00<<1) ; 12-bit right-adjusted result
.equ ADC_RESOLUTION_MT12BIT_gc = (0x01<<1) ; More than 12-bit (oversapling) right-adjusted result
.equ ADC_RESOLUTION_8BIT_gc = (0x02<<1) ; 8-bit right-adjusted result
.equ ADC_RESOLUTION_LEFT12BIT_gc = (0x03<<1) ; 12-bit left-adjusted result

; Voltage reference selection
.equ ADC_REFSEL_INT1V_gc = (0x00<<4) ; Internal 1V
.equ ADC_REFSEL_INTVCC_gc = (0x01<<4) ; Internal VCC / 1.6
.equ ADC_REFSEL_AREFA_gc = (0x02<<4) ; External reference on PORT A
.equ ADC_REFSEL_AREFD_gc = (0x03<<4) ; External reference on PORT D
.equ ADC_REFSEL_INTVCC2_gc = (0x04<<4) ; Internal VCC / 2

; Event channel input selection
.equ ADC_EVSEL_0_gc = (0x00<<3) ; Event Channel 0
.equ ADC_EVSEL_1_gc = (0x01<<3) ; Event Channel 1
.equ ADC_EVSEL_2_gc = (0x02<<3) ; Event Channel 2
.equ ADC_EVSEL_3_gc = (0x03<<3) ; Event Channel 3
.equ ADC_EVSEL_4_gc = (0x04<<3) ; Event Channel 4
.equ ADC_EVSEL_5_gc = (0x05<<3) ; Event Channel 5
.equ ADC_EVSEL_6_gc = (0x06<<3) ; Event Channel 6
.equ ADC_EVSEL_7_gc = (0x07<<3) ; Event Channel 7

; Event action selection
.equ ADC_EVACT_NONE_gc = (0x00<<0) ; No event action
.equ ADC_EVACT_CH0_gc = (0x01<<0) ; First event triggers channel conversion
.equ ADC_EVACT_SYNCHSWEEP_gc = (0x06<<0) ; First event triggers synchronized sweep

; Clock prescaler
.equ ADC_PRESCALER_DIV4_gc = (0x00<<0) ; Divide clock by 4
.equ ADC_PRESCALER_DIV8_gc = (0x01<<0) ; Divide clock by 8
.equ ADC_PRESCALER_DIV16_gc = (0x02<<0) ; Divide clock by 16
.equ ADC_PRESCALER_DIV32_gc = (0x03<<0) ; Divide clock by 32
.equ ADC_PRESCALER_DIV64_gc = (0x04<<0) ; Divide clock by 64
.equ ADC_PRESCALER_DIV128_gc = (0x05<<0) ; Divide clock by 128
.equ ADC_PRESCALER_DIV256_gc = (0x06<<0) ; Divide clock by 256
.equ ADC_PRESCALER_DIV512_gc = (0x07<<0) ; Divide clock by 512

; Gain factor
.equ ADC_CH_GAIN_1X_gc = (0x00<<2) ; 1x gain
.equ ADC_CH_GAIN_2X_gc = (0x01<<2) ; 2x gain
.equ ADC_CH_GAIN_4X_gc = (0x02<<2) ; 4x gain
.equ ADC_CH_GAIN_8X_gc = (0x03<<2) ; 8x gain
.equ ADC_CH_GAIN_16X_gc = (0x04<<2) ; 16x gain
.equ ADC_CH_GAIN_32X_gc = (0x05<<2) ; 32x gain
.equ ADC_CH_GAIN_64X_gc = (0x06<<2) ; 64x gain
.equ ADC_CH_GAIN_DIV2_gc = (0x07<<2) ; x/2 gain

; Input mode
.equ ADC_CH_INPUTMODE_INTERNAL_gc = (0x00<<0) ; Internal inputs, no gain
.equ ADC_CH_INPUTMODE_SINGLEENDED_gc = (0x01<<0) ; Single-ended input, no gain
.equ ADC_CH_INPUTMODE_DIFFWGAINL_gc = (0x02<<0) ; Differential input, gain with 4 LSB pins selection
.equ ADC_CH_INPUTMODE_DIFFWGAINH_gc = (0x03<<0) ; Differential input, gain with 4 MSB pins selection

; Positive input multiplexer selection
.equ ADC_CH_MUXPOS_PIN0_gc = (0x00<<3) ; Input pin 0
.equ ADC_CH_MUXPOS_PIN1_gc = (0x01<<3) ; Input pin 1
.equ ADC_CH_MUXPOS_PIN2_gc = (0x02<<3) ; Input pin 2
.equ ADC_CH_MUXPOS_PIN3_gc = (0x03<<3) ; Input pin 3
.equ ADC_CH_MUXPOS_PIN4_gc = (0x04<<3) ; Input pin 4
.equ ADC_CH_MUXPOS_PIN5_gc = (0x05<<3) ; Input pin 5
.equ ADC_CH_MUXPOS_PIN6_gc = (0x06<<3) ; Input pin 6
.equ ADC_CH_MUXPOS_PIN7_gc = (0x07<<3) ; Input pin 7
.equ ADC_CH_MUXPOS_PIN8_gc = (0x08<<3) ; Input pin 8
.equ ADC_CH_MUXPOS_PIN9_gc = (0x09<<3) ; Input pin 9
.equ ADC_CH_MUXPOS_PIN10_gc = (0x0A<<3) ; Input pin 10
.equ ADC_CH_MUXPOS_PIN11_gc = (0x0B<<3) ; Input pin 11
.equ ADC_CH_MUXPOS_PIN12_gc = (0x0C<<3) ; Input pin 12
.equ ADC_CH_MUXPOS_PIN13_gc = (0x0D<<3) ; Input pin 13
.equ ADC_CH_MUXPOS_PIN14_gc = (0x0E<<3) ; Input pin 14
.equ ADC_CH_MUXPOS_PIN15_gc = (0x0F<<3) ; Input pin 15

; Internal input multiplexer selections
.equ ADC_CH_MUXINT_TEMP_gc = (0x00<<3) ; Temperature Reference
.equ ADC_CH_MUXINT_BANDGAP_gc = (0x01<<3) ; Bandgap Reference
.equ ADC_CH_MUXINT_SCALEDVCC_gc = (0x02<<3) ; 1/10 Scaled VCC
.equ ADC_CH_MUXINT_DAC_gc = (0x03<<3) ; DAC Output

; Negative input multiplexer selection when gain on 4 LSB pins
.equ ADC_CH_MUXNEGL_PIN0_gc = (0x00<<0) ; Input pin 0
.equ ADC_CH_MUXNEGL_PIN1_gc = (0x01<<0) ; Input pin 1
.equ ADC_CH_MUXNEGL_PIN2_gc = (0x02<<0) ; Input pin 2
.equ ADC_CH_MUXNEGL_PIN3_gc = (0x03<<0) ; Input pin 3
.equ ADC_CH_MUXNEGL_GND_gc = (0x05<<0) ; PAD ground
.equ ADC_CH_MUXNEGL_INTGND_gc = (0x07<<0) ; Internal ground

; Negative input multiplexer selection when gain on 4 MSB pins
.equ ADC_CH_MUXNEGH_PIN4_gc = (0x00<<0) ; Input pin 4
.equ ADC_CH_MUXNEGH_PIN5_gc = (0x01<<0) ; Input pin 5
.equ ADC_CH_MUXNEGH_PIN6_gc = (0x02<<0) ; Input pin 6
.equ ADC_CH_MUXNEGH_PIN7_gc = (0x03<<0) ; Input pin 7
.equ ADC_CH_MUXNEGH_INTGND_gc = (0x04<<0) ; Internal ground
.equ ADC_CH_MUXNEGH_GND_gc = (0x05<<0) ; PAD ground

; Negative input multiplexer selection
.equ ADC_CH_MUXNEG_PIN0_gc = (0x00<<0) ; Input pin 0

