trol73/avr-make/asm/include/ATxmega32E5def.inc
; Windows interrupt mode
.equ AC_WINTMODE_ABOVE_gc = (0x00<<2) ; Interrupt on above window
.equ AC_WINTMODE_INSIDE_gc = (0x01<<2) ; Interrupt on inside window
.equ AC_WINTMODE_BELOW_gc = (0x02<<2) ; Interrupt on below window
.equ AC_WINTMODE_OUTSIDE_gc = (0x03<<2) ; Interrupt on outside window

; Window interrupt level
.equ AC_WINTLVL_OFF_gc = (0x00<<0) ; Interrupt disabled
.equ AC_WINTLVL_LO_gc = (0x01<<0) ; Low priority
.equ AC_WINTLVL_MED_gc = (0x02<<0) ; Medium priority
.equ AC_WINTLVL_HI_gc = (0x03<<0) ; High priority

; Window mode state
.equ AC_WSTATE_ABOVE_gc = (0x00<<6) ; Signal above window
.equ AC_WSTATE_INSIDE_gc = (0x01<<6) ; Signal inside window
.equ AC_WSTATE_BELOW_gc = (0x02<<6) ; Signal below window


;*************************************************************************
;** RTC - Real-Time Clounter
;*************************************************************************

; RTC_CTRL masks
.equ RTC_CORREN_bm = 0x08 ; Correction Enable bit mask
.equ RTC_CORREN_bp = 3 ; Correction Enable bit position
.equ RTC_PRESCALER_gm = 0x07 ; Prescaling Factor group mask
.equ RTC_PRESCALER_gp = 0 ; Prescaling Factor group position
.equ RTC_PRESCALER0_bm = (1<<0) ; Prescaling Factor bit 0 mask
.equ RTC_PRESCALER0_bp = 0 ; Prescaling Factor bit 0 position
.equ RTC_PRESCALER1_bm = (1<<1) ; Prescaling Factor bit 1 mask
.equ RTC_PRESCALER1_bp = 1 ; Prescaling Factor bit 1 position
.equ RTC_PRESCALER2_bm = (1<<2) ; Prescaling Factor bit 2 mask
.equ RTC_PRESCALER2_bp = 2 ; Prescaling Factor bit 2 position

; RTC_STATUS masks
.equ RTC_SYNCBUSY_bm = 0x01 ; Synchronization Busy Flag bit mask
.equ RTC_SYNCBUSY_bp = 0 ; Synchronization Busy Flag bit position

; RTC_INTCTRL masks
.equ RTC_COMPINTLVL_gm = 0x0C ; Compare Match Interrupt Level group mask
.equ RTC_COMPINTLVL_gp = 2 ; Compare Match Interrupt Level group position
.equ RTC_COMPINTLVL0_bm = (1<<2) ; Compare Match Interrupt Level bit 0 mask
.equ RTC_COMPINTLVL0_bp = 2 ; Compare Match Interrupt Level bit 0 position
.equ RTC_COMPINTLVL1_bm = (1<<3) ; Compare Match Interrupt Level bit 1 mask
.equ RTC_COMPINTLVL1_bp = 3 ; Compare Match Interrupt Level bit 1 position
.equ RTC_OVFINTLVL_gm = 0x03 ; Overflow Interrupt Level group mask
.equ RTC_OVFINTLVL_gp = 0 ; Overflow Interrupt Level group position
.equ RTC_OVFINTLVL0_bm = (1<<0) ; Overflow Interrupt Level bit 0 mask
.equ RTC_OVFINTLVL0_bp = 0 ; Overflow Interrupt Level bit 0 position
.equ RTC_OVFINTLVL1_bm = (1<<1) ; Overflow Interrupt Level bit 1 mask
.equ RTC_OVFINTLVL1_bp = 1 ; Overflow Interrupt Level bit 1 position

; RTC_INTFLAGS masks
.equ RTC_COMPIF_bm = 0x02 ; Compare Match Interrupt Flag bit mask
.equ RTC_COMPIF_bp = 1 ; Compare Match Interrupt Flag bit position
.equ RTC_OVFIF_bm = 0x01 ; Overflow Interrupt Flag bit mask
.equ RTC_OVFIF_bp = 0 ; Overflow Interrupt Flag bit position

; RTC_CALIB masks
.equ RTC_SIGN_bm = 0x80 ; Correction Sign bit mask
.equ RTC_SIGN_bp = 7 ; Correction Sign bit position
.equ RTC_ERROR_gm = 0x7F ; Error Value group mask
.equ RTC_ERROR_gp = 0 ; Error Value group position
.equ RTC_ERROR0_bm = (1<<0) ; Error Value bit 0 mask
.equ RTC_ERROR0_bp = 0 ; Error Value bit 0 position
.equ RTC_ERROR1_bm = (1<<1) ; Error Value bit 1 mask
.equ RTC_ERROR1_bp = 1 ; Error Value bit 1 position
.equ RTC_ERROR2_bm = (1<<2) ; Error Value bit 2 mask
.equ RTC_ERROR2_bp = 2 ; Error Value bit 2 position
.equ RTC_ERROR3_bm = (1<<3) ; Error Value bit 3 mask
.equ RTC_ERROR3_bp = 3 ; Error Value bit 3 position
.equ RTC_ERROR4_bm = (1<<4) ; Error Value bit 4 mask
.equ RTC_ERROR4_bp = 4 ; Error Value bit 4 position
.equ RTC_ERROR5_bm = (1<<5) ; Error Value bit 5 mask
.equ RTC_ERROR5_bp = 5 ; Error Value bit 5 position
.equ RTC_ERROR6_bm = (1<<6) ; Error Value bit 6 mask
.equ RTC_ERROR6_bp = 6 ; Error Value bit 6 position

; Prescaler Factor
.equ RTC_PRESCALER_OFF_gc = (0x00<<0) ; RTC Off
.equ RTC_PRESCALER_DIV1_gc = (0x01<<0) ; RTC Clock
.equ RTC_PRESCALER_DIV2_gc = (0x02<<0) ; RTC Clock / 2
.equ RTC_PRESCALER_DIV8_gc = (0x03<<0) ; RTC Clock / 8
.equ RTC_PRESCALER_DIV16_gc = (0x04<<0) ; RTC Clock / 16
.equ RTC_PRESCALER_DIV64_gc = (0x05<<0) ; RTC Clock / 64
.equ RTC_PRESCALER_DIV256_gc = (0x06<<0) ; RTC Clock / 256
.equ RTC_PRESCALER_DIV1024_gc = (0x07<<0) ; RTC Clock / 1024

; Compare Interrupt level
.equ RTC_COMPINTLVL_OFF_gc = (0x00<<2) ; Interrupt Disabled
.equ RTC_COMPINTLVL_LO_gc = (0x01<<2) ; Low Level
.equ RTC_COMPINTLVL_MED_gc = (0x02<<2) ; Medium Level
.equ RTC_COMPINTLVL_HI_gc = (0x03<<2) ; High Level

; Overflow Interrupt level
.equ RTC_OVFINTLVL_OFF_gc = (0x00<<0) ; Interrupt Disabled
.equ RTC_OVFINTLVL_LO_gc = (0x01<<0) ; Low Level
.equ RTC_OVFINTLVL_MED_gc = (0x02<<0) ; Medium Level
.equ RTC_OVFINTLVL_HI_gc = (0x03<<0) ; High Level


;*************************************************************************
;** XCL - XMEGA Custom Logic
;*************************************************************************

; XCL_CTRLA masks
.equ XCL_LUT0OUTEN_gm = 0xC0 ; LUT0 Output Enable group mask
.equ XCL_LUT0OUTEN_gp = 6 ; LUT0 Output Enable group position
.equ XCL_LUT0OUTEN0_bm = (1<<6) ; LUT0 Output Enable bit 0 mask
.equ XCL_LUT0OUTEN0_bp = 6 ; LUT0 Output Enable bit 0 position
.equ XCL_LUT0OUTEN1_bm = (1<<7) ; LUT0 Output Enable bit 1 mask
.equ XCL_LUT0OUTEN1_bp = 7 ; LUT0 Output Enable bit 1 position
.equ XCL_PORTSEL_gm = 0x30 ; Port Selection group mask
.equ XCL_PORTSEL_gp = 4 ; Port Selection group position
.equ XCL_PORTSEL0_bm = (1<<4) ; Port Selection bit 0 mask
.equ XCL_PORTSEL0_bp = 4 ; Port Selection bit 0 position
.equ XCL_PORTSEL1_bm = (1<<5) ; Port Selection bit 1 mask
.equ XCL_PORTSEL1_bp = 5 ; Port Selection bit 1 position
.equ XCL_LUTCONF_gm = 0x07 ; LUT Configuration group mask
.equ XCL_LUTCONF_gp = 0 ; LUT Configuration group position
.equ XCL_LUTCONF0_bm = (1<<0) ; LUT Configuration bit 0 mask
.equ XCL_LUTCONF0_bp = 0 ; LUT Configuration bit 0 position
.equ XCL_LUTCONF1_bm = (1<<1) ; LUT Configuration bit 1 mask
.equ XCL_LUTCONF1_bp = 1 ; LUT Configuration bit 1 position
.equ XCL_LUTCONF2_bm = (1<<2) ; LUT Configuration bit 2 mask
.equ XCL_LUTCONF2_bp = 2 ; LUT Configuration bit 2 position

; XCL_CTRLB masks
.equ XCL_IN3SEL_gm = 0xC0 ; Input Selection 3 group mask
.equ XCL_IN3SEL_gp = 6 ; Input Selection 3 group position
.equ XCL_IN3SEL0_bm = (1<<6) ; Input Selection 3 bit 0 mask
.equ XCL_IN3SEL0_bp = 6 ; Input Selection 3 bit 0 position
.equ XCL_IN3SEL1_bm = (1<<7) ; Input Selection 3 bit 1 mask
.equ XCL_IN3SEL1_bp = 7 ; Input Selection 3 bit 1 position
.equ XCL_IN2SEL_gm = 0x30 ; Input Selection 2 group mask
.equ XCL_IN2SEL_gp = 4 ; Input Selection 2 group position
.equ XCL_IN2SEL0_bm = (1<<4) ; Input Selection 2 bit 0 mask
.equ XCL_IN2SEL0_bp = 4 ; Input Selection 2 bit 0 position
.equ XCL_IN2SEL1_bm = (1<<5) ; Input Selection 2 bit 1 mask
.equ XCL_IN2SEL1_bp = 5 ; Input Selection 2 bit 1 position
.equ XCL_IN1SEL_gm = 0x0C ; Input Selection 1 group mask
.equ XCL_IN1SEL_gp = 2 ; Input Selection 1 group position
.equ XCL_IN1SEL0_bm = (1<<2) ; Input Selection 1 bit 0 mask
.equ XCL_IN1SEL0_bp = 2 ; Input Selection 1 bit 0 position
.equ XCL_IN1SEL1_bm = (1<<3) ; Input Selection 1 bit 1 mask
.equ XCL_IN1SEL1_bp = 3 ; Input Selection 1 bit 1 position
.equ XCL_IN0SEL_gm = 0x03 ; Input Selection 0 group mask
.equ XCL_IN0SEL_gp = 0 ; Input Selection 0 group position
.equ XCL_IN0SEL0_bm = (1<<0) ; Input Selection 0 bit 0 mask
.equ XCL_IN0SEL0_bp = 0 ; Input Selection 0 bit 0 position
.equ XCL_IN0SEL1_bm = (1<<1) ; Input Selection 0 bit 1 mask
.equ XCL_IN0SEL1_bp = 1 ; Input Selection 0 bit 1 position

; XCL_CTRLC masks
.equ XCL_DLYSEL_gm = 0x30 ; Delay Selection group mask
.equ XCL_DLYSEL_gp = 4 ; Delay Selection group position
.equ XCL_DLYSEL0_bm = (1<<4) ; Delay Selection bit 0 mask
.equ XCL_DLYSEL0_bp = 4 ; Delay Selection bit 0 position
.equ XCL_DLYSEL1_bm = (1<<5) ; Delay Selection bit 1 mask
.equ XCL_DLYSEL1_bp = 5 ; Delay Selection bit 1 position
.equ XCL_DLY1CONF_gm = 0x0C ; Delay Configuration on LUT1 group mask
.equ XCL_DLY1CONF_gp = 2 ; Delay Configuration on LUT1 group position
.equ XCL_DLY1CONF0_bm = (1<<2) ; Delay Configuration on LUT1 bit 0 mask
.equ XCL_DLY1CONF0_bp = 2 ; Delay Configuration on LUT1 bit 0 position
.equ XCL_DLY1CONF1_bm = (1<<3) ; Delay Configuration on LUT1 bit 1 mask
.equ XCL_DLY1CONF1_bp = 3 ; Delay Configuration on LUT1 bit 1 position
.equ XCL_DLY0CONF_gm = 0x03 ; Delay Configuration on LUT0 group mask
.equ XCL_DLY0CONF_gp = 0 ; Delay Configuration on LUT0 group position
.equ XCL_DLY0CONF0_bm = (1<<0) ; Delay Configuration on LUT0 bit 0 mask
.equ XCL_DLY0CONF0_bp = 0 ; Delay Configuration on LUT0 bit 0 position
.equ XCL_DLY0CONF1_bm = (1<<1) ; Delay Configuration on LUT0 bit 1 mask
.equ XCL_DLY0CONF1_bp = 1 ; Delay Configuration on LUT0 bit 1 position

