trol73/avr-make/asm/include/ATxmega32E5def.inc
; Inactive Timeout
.equ TWI_MASTER_TIMEOUT_DISABLED_gc = (0x00<<2) ; Bus Timeout Disabled
.equ TWI_MASTER_TIMEOUT_50US_gc = (0x01<<2) ; 50 Microseconds
.equ TWI_MASTER_TIMEOUT_100US_gc = (0x02<<2) ; 100 Microseconds
.equ TWI_MASTER_TIMEOUT_200US_gc = (0x03<<2) ; 200 Microseconds

; Master Command
.equ TWI_MASTER_CMD_NOACT_gc = (0x00<<0) ; No Action
.equ TWI_MASTER_CMD_REPSTART_gc = (0x01<<0) ; Issue Repeated Start Condition
.equ TWI_MASTER_CMD_RECVTRANS_gc = (0x02<<0) ; Receive or Transmit Data
.equ TWI_MASTER_CMD_STOP_gc = (0x03<<0) ; Issue Stop Condition

; Master Bus State
.equ TWI_MASTER_BUSSTATE_UNKNOWN_gc = (0x00<<0) ; Unknown Bus State
.equ TWI_MASTER_BUSSTATE_IDLE_gc = (0x01<<0) ; Bus is Idle
.equ TWI_MASTER_BUSSTATE_OWNER_gc = (0x02<<0) ; This Module Controls The Bus
.equ TWI_MASTER_BUSSTATE_BUSY_gc = (0x03<<0) ; The Bus is Busy

; Slave Interrupt Level
.equ TWI_SLAVE_INTLVL_OFF_gc = (0x00<<6) ; Interrupt Disabled
.equ TWI_SLAVE_INTLVL_LO_gc = (0x01<<6) ; Low Level
.equ TWI_SLAVE_INTLVL_MED_gc = (0x02<<6) ; Medium Level
.equ TWI_SLAVE_INTLVL_HI_gc = (0x03<<6) ; High Level

; Slave Command
.equ TWI_SLAVE_CMD_NOACT_gc = (0x00<<0) ; No Action
.equ TWI_SLAVE_CMD_COMPTRANS_gc = (0x02<<0) ; Used To Complete a Transaction
.equ TWI_SLAVE_CMD_RESPONSE_gc = (0x03<<0) ; Used in Response to Address/Data Interrupt


;*************************************************************************
;** PORT - Port Configuration
;*************************************************************************

; PORT_INTCTRL masks
.equ PORT_INTLVL_gm = 0x03 ; Port Interrupt Level group mask
.equ PORT_INTLVL_gp = 0 ; Port Interrupt Level group position
.equ PORT_INTLVL0_bm = (1<<0) ; Port Interrupt Level bit 0 mask
.equ PORT_INTLVL0_bp = 0 ; Port Interrupt Level bit 0 position
.equ PORT_INTLVL1_bm = (1<<1) ; Port Interrupt Level bit 1 mask
.equ PORT_INTLVL1_bp = 1 ; Port Interrupt Level bit 1 position

; PORT_INTFLAGS masks
.equ PORT_INT7IF_bm = 0x80 ; Pin 7 Interrupt Flag bit mask
.equ PORT_INT7IF_bp = 7 ; Pin 7 Interrupt Flag bit position
.equ PORT_INT6IF_bm = 0x40 ; Pin 6 Interrupt Flag bit mask
.equ PORT_INT6IF_bp = 6 ; Pin 6 Interrupt Flag bit position
.equ PORT_INT5IF_bm = 0x20 ; Pin 5 Interrupt Flag bit mask
.equ PORT_INT5IF_bp = 5 ; Pin 5 Interrupt Flag bit position
.equ PORT_INT4IF_bm = 0x10 ; Pin 4 Interrupt Flag bit mask
.equ PORT_INT4IF_bp = 4 ; Pin 4 Interrupt Flag bit position
.equ PORT_INT3IF_bm = 0x08 ; Pin 3 Interrupt Flag bit mask
.equ PORT_INT3IF_bp = 3 ; Pin 3 Interrupt Flag bit position
.equ PORT_INT2IF_bm = 0x04 ; Pin 2 Interrupt Flag bit mask
.equ PORT_INT2IF_bp = 2 ; Pin 2 Interrupt Flag bit position
.equ PORT_INT1IF_bm = 0x02 ; Pin 1 Interrupt Flag bit mask
.equ PORT_INT1IF_bp = 1 ; Pin 1 Interrupt Flag bit position
.equ PORT_INT0IF_bm = 0x01 ; Pin 0 Interrupt Flag bit mask
.equ PORT_INT0IF_bp = 0 ; Pin 0 Interrupt Flag bit position

; PORT_REMAP masks
.equ PORT_USART0_bm = 0x10 ; Usart0 bit mask
.equ PORT_USART0_bp = 4 ; Usart0 bit position
.equ PORT_TC4D_bm = 0x08 ; Timer/Counter 4 Output Compare D bit mask
.equ PORT_TC4D_bp = 3 ; Timer/Counter 4 Output Compare D bit position
.equ PORT_TC4C_bm = 0x04 ; Timer/Counter 4 Output Compare C bit mask
.equ PORT_TC4C_bp = 2 ; Timer/Counter 4 Output Compare C bit position
.equ PORT_TC4B_bm = 0x02 ; Timer/Counter 4 Output Compare B bit mask
.equ PORT_TC4B_bp = 1 ; Timer/Counter 4 Output Compare B bit position
.equ PORT_TC4A_bm = 0x01 ; Timer/Counter 4 Output Compare A bit mask
.equ PORT_TC4A_bp = 0 ; Timer/Counter 4 Output Compare A bit position

; PORT_PIN0CTRL masks
.equ PORT_INVEN_bm = 0x40 ; Inverted I/O Enable bit mask
.equ PORT_INVEN_bp = 6 ; Inverted I/O Enable bit position
.equ PORT_OPC_gm = 0x38 ; Output/Pull Configuration group mask
.equ PORT_OPC_gp = 3 ; Output/Pull Configuration group position
.equ PORT_OPC0_bm = (1<<3) ; Output/Pull Configuration bit 0 mask
.equ PORT_OPC0_bp = 3 ; Output/Pull Configuration bit 0 position
.equ PORT_OPC1_bm = (1<<4) ; Output/Pull Configuration bit 1 mask
.equ PORT_OPC1_bp = 4 ; Output/Pull Configuration bit 1 position
.equ PORT_OPC2_bm = (1<<5) ; Output/Pull Configuration bit 2 mask
.equ PORT_OPC2_bp = 5 ; Output/Pull Configuration bit 2 position
.equ PORT_ISC_gm = 0x07 ; Input/Sense Configuration group mask
.equ PORT_ISC_gp = 0 ; Input/Sense Configuration group position
.equ PORT_ISC0_bm = (1<<0) ; Input/Sense Configuration bit 0 mask
.equ PORT_ISC0_bp = 0 ; Input/Sense Configuration bit 0 position
.equ PORT_ISC1_bm = (1<<1) ; Input/Sense Configuration bit 1 mask
.equ PORT_ISC1_bp = 1 ; Input/Sense Configuration bit 1 position
.equ PORT_ISC2_bm = (1<<2) ; Input/Sense Configuration bit 2 mask
.equ PORT_ISC2_bp = 2 ; Input/Sense Configuration bit 2 position

; PORT_PIN1CTRL masks
; Masks for PORT_INVEN already defined
; Masks for PORT_OPC already defined
; Masks for PORT_ISC already defined

; PORT_PIN2CTRL masks
; Masks for PORT_INVEN already defined
; Masks for PORT_OPC already defined
; Masks for PORT_ISC already defined

; PORT_PIN3CTRL masks
; Masks for PORT_INVEN already defined
; Masks for PORT_OPC already defined
; Masks for PORT_ISC already defined

; PORT_PIN4CTRL masks
; Masks for PORT_INVEN already defined
; Masks for PORT_OPC already defined
; Masks for PORT_ISC already defined

; PORT_PIN5CTRL masks
; Masks for PORT_INVEN already defined
; Masks for PORT_OPC already defined
; Masks for PORT_ISC already defined

; PORT_PIN6CTRL masks
; Masks for PORT_INVEN already defined
; Masks for PORT_OPC already defined
; Masks for PORT_ISC already defined

; PORT_PIN7CTRL masks
; Masks for PORT_INVEN already defined
; Masks for PORT_OPC already defined
; Masks for PORT_ISC already defined

; Port Interrupt Level
.equ PORT_INTLVL_OFF_gc = (0x00<<0) ; Interrupt Disabled
.equ PORT_INTLVL_LO_gc = (0x01<<0) ; Low Level
.equ PORT_INTLVL_MED_gc = (0x02<<0) ; Medium Level
.equ PORT_INTLVL_HI_gc = (0x03<<0) ; High Level

; Output/Pull Configuration
.equ PORT_OPC_TOTEM_gc = (0x00<<3) ; Totempole
.equ PORT_OPC_BUSKEEPER_gc = (0x01<<3) ; Totempole w/ Bus keeper on Input and Output
.equ PORT_OPC_PULLDOWN_gc = (0x02<<3) ; Totempole w/ Pull-down on Input
.equ PORT_OPC_PULLUP_gc = (0x03<<3) ; Totempole w/ Pull-up on Input
.equ PORT_OPC_WIREDOR_gc = (0x04<<3) ; Wired OR
.equ PORT_OPC_WIREDAND_gc = (0x05<<3) ; Wired AND
.equ PORT_OPC_WIREDORPULL_gc = (0x06<<3) ; Wired OR w/ Pull-down
.equ PORT_OPC_WIREDANDPULL_gc = (0x07<<3) ; Wired AND w/ Pull-up

; Input/Sense Configuration
.equ PORT_ISC_BOTHEDGES_gc = (0x00<<0) ; Sense Both Edges
.equ PORT_ISC_RISING_gc = (0x01<<0) ; Sense Rising Edge
.equ PORT_ISC_FALLING_gc = (0x02<<0) ; Sense Falling Edge
.equ PORT_ISC_LEVEL_gc = (0x03<<0) ; Sense Level (Transparent For Events)
.equ PORT_ISC_FORCE_ENABLE_gc = (0x06<<0) ; Digital Input Buffer Forced Enable
.equ PORT_ISC_INPUT_DISABLE_gc = (0x07<<0) ; Disable Digital Input Buffer


;*************************************************************************
;** TC - 16-bit Timer/Counter With PWM
;*************************************************************************

; TC4_CTRLA masks
.equ TC4_SYNCHEN_bm = 0x40 ; Synchronization Enabled bit mask
.equ TC4_SYNCHEN_bp = 6 ; Synchronization Enabled bit position
.equ TC4_EVSTART_bm = 0x20 ; Start on Next Event bit mask
.equ TC4_EVSTART_bp = 5 ; Start on Next Event bit position
.equ TC4_UPSTOP_bm = 0x10 ; Stop on Next Update bit mask
.equ TC4_UPSTOP_bp = 4 ; Stop on Next Update bit position
.equ TC4_CLKSEL_gm = 0x0F ; Clock Select group mask
.equ TC4_CLKSEL_gp = 0 ; Clock Select group position
.equ TC4_CLKSEL0_bm = (1<<0) ; Clock Select bit 0 mask
.equ TC4_CLKSEL0_bp = 0 ; Clock Select bit 0 position
.equ TC4_CLKSEL1_bm = (1<<1) ; Clock Select bit 1 mask
.equ TC4_CLKSEL1_bp = 1 ; Clock Select bit 1 position
.equ TC4_CLKSEL2_bm = (1<<2) ; Clock Select bit 2 mask
.equ TC4_CLKSEL2_bp = 2 ; Clock Select bit 2 position
.equ TC4_CLKSEL3_bm = (1<<3) ; Clock Select bit 3 mask
.equ TC4_CLKSEL3_bp = 3 ; Clock Select bit 3 position

; TC4_CTRLB masks
.equ TC4_BYTEM_gm = 0xC0 ; Byte Mode group mask
.equ TC4_BYTEM_gp = 6 ; Byte Mode group position
.equ TC4_BYTEM0_bm = (1<<6) ; Byte Mode bit 0 mask
.equ TC4_BYTEM0_bp = 6 ; Byte Mode bit 0 position
.equ TC4_BYTEM1_bm = (1<<7) ; Byte Mode bit 1 mask
.equ TC4_BYTEM1_bp = 7 ; Byte Mode bit 1 position
.equ TC4_CIRCEN_gm = 0x30 ; Circular Buffer Enable group mask
.equ TC4_CIRCEN_gp = 4 ; Circular Buffer Enable group position
.equ TC4_CIRCEN0_bm = (1<<4) ; Circular Buffer Enable bit 0 mask
.equ TC4_CIRCEN0_bp = 4 ; Circular Buffer Enable bit 0 position
.equ TC4_CIRCEN1_bm = (1<<5) ; Circular Buffer Enable bit 1 mask
.equ TC4_CIRCEN1_bp = 5 ; Circular Buffer Enable bit 1 position
.equ TC4_WGMODE_gm = 0x07 ; Waveform Generation Mode group mask
.equ TC4_WGMODE_gp = 0 ; Waveform Generation Mode group position
.equ TC4_WGMODE0_bm = (1<<0) ; Waveform Generation Mode bit 0 mask
.equ TC4_WGMODE0_bp = 0 ; Waveform Generation Mode bit 0 position
.equ TC4_WGMODE1_bm = (1<<1) ; Waveform Generation Mode bit 1 mask
.equ TC4_WGMODE1_bp = 1 ; Waveform Generation Mode bit 1 position
.equ TC4_WGMODE2_bm = (1<<2) ; Waveform Generation Mode bit 2 mask
.equ TC4_WGMODE2_bp = 2 ; Waveform Generation Mode bit 2 position

; TC4_CTRLC masks
.equ TC4_POLD_bm = 0x80 ; Channel D Output Polarity bit mask
.equ TC4_POLD_bp = 7 ; Channel D Output Polarity bit position
.equ TC4_POLC_bm = 0x40 ; Channel C Output Polarity bit mask
.equ TC4_POLC_bp = 6 ; Channel C Output Polarity bit position
.equ TC4_POLB_bm = 0x20 ; Channel B Output Polarity bit mask
.equ TC4_POLB_bp = 5 ; Channel B Output Polarity bit position
.equ TC4_POLA_bm = 0x10 ; Channel A Output Polarity bit mask
.equ TC4_POLA_bp = 4 ; Channel A Output Polarity bit position
.equ TC4_CMPD_bm = 0x08 ; Channel D Compare Output Value bit mask
.equ TC4_CMPD_bp = 3 ; Channel D Compare Output Value bit position
.equ TC4_CMPC_bm = 0x04 ; Channel C Compare Output Value bit mask
.equ TC4_CMPC_bp = 2 ; Channel C Compare Output Value bit position
.equ TC4_CMPB_bm = 0x02 ; Channel B Compare Output Value bit mask
.equ TC4_CMPB_bp = 1 ; Channel B Compare Output Value bit position
.equ TC4_CMPA_bm = 0x01 ; Channel A Compare Output Value bit mask
.equ TC4_CMPA_bp = 0 ; Channel A Compare Output Value bit position
.equ TC4_HCMPD_bm = 0x80 ; High Channel D Compare Output Value bit mask
.equ TC4_HCMPD_bp = 7 ; High Channel D Compare Output Value bit position
.equ TC4_HCMPC_bm = 0x40 ; High Channel C Compare Output Value bit mask
.equ TC4_HCMPC_bp = 6 ; High Channel C Compare Output Value bit position
.equ TC4_HCMPB_bm = 0x20 ; High Channel B Compare Output Value bit mask
.equ TC4_HCMPB_bp = 5 ; High Channel B Compare Output Value bit position
.equ TC4_HCMPA_bm = 0x10 ; High Channel A Compare Output Value bit mask
.equ TC4_HCMPA_bp = 4 ; High Channel A Compare Output Value bit position
.equ TC4_LCMPD_bm = 0x08 ; Low Channel D Compare Output Value bit mask
.equ TC4_LCMPD_bp = 3 ; Low Channel D Compare Output Value bit position
.equ TC4_LCMPC_bm = 0x04 ; Low Channel C Compare Output Value bit mask
.equ TC4_LCMPC_bp = 2 ; Low Channel C Compare Output Value bit position
.equ TC4_LCMPB_bm = 0x02 ; Low Channel B Compare Output Value bit mask
.equ TC4_LCMPB_bp = 1 ; Low Channel B Compare Output Value bit position
.equ TC4_LCMPA_bm = 0x01 ; Low Channel A Compare Output Value bit mask
.equ TC4_LCMPA_bp = 0 ; Low Channel A Compare Output Value bit position

; TC4_CTRLD masks
.equ TC4_EVACT_gm = 0xE0 ; Event Action group mask
.equ TC4_EVACT_gp = 5 ; Event Action group position
.equ TC4_EVACT0_bm = (1<<5) ; Event Action bit 0 mask
.equ TC4_EVACT0_bp = 5 ; Event Action bit 0 position
.equ TC4_EVACT1_bm = (1<<6) ; Event Action bit 1 mask
.equ TC4_EVACT1_bp = 6 ; Event Action bit 1 position
.equ TC4_EVACT2_bm = (1<<7) ; Event Action bit 2 mask
.equ TC4_EVACT2_bp = 7 ; Event Action bit 2 position
.equ TC4_EVDLY_bm = 0x10 ; Event Delay bit mask
.equ TC4_EVDLY_bp = 4 ; Event Delay bit position
.equ TC4_EVSEL_gm = 0x0F ; Event Source Select group mask
.equ TC4_EVSEL_gp = 0 ; Event Source Select group position
.equ TC4_EVSEL0_bm = (1<<0) ; Event Source Select bit 0 mask
.equ TC4_EVSEL0_bp = 0 ; Event Source Select bit 0 position
.equ TC4_EVSEL1_bm = (1<<1) ; Event Source Select bit 1 mask
.equ TC4_EVSEL1_bp = 1 ; Event Source Select bit 1 position
.equ TC4_EVSEL2_bm = (1<<2) ; Event Source Select bit 2 mask
.equ TC4_EVSEL2_bp = 2 ; Event Source Select bit 2 position
.equ TC4_EVSEL3_bm = (1<<3) ; Event Source Select bit 3 mask
.equ TC4_EVSEL3_bp = 3 ; Event Source Select bit 3 position

; TC4_CTRLE masks
.equ TC4_CCDMODE_gm = 0xC0 ; Channel D Compare or Capture Mode group mask
.equ TC4_CCDMODE_gp = 6 ; Channel D Compare or Capture Mode group position
.equ TC4_CCDMODE0_bm = (1<<6) ; Channel D Compare or Capture Mode bit 0 mask
.equ TC4_CCDMODE0_bp = 6 ; Channel D Compare or Capture Mode bit 0 position
.equ TC4_CCDMODE1_bm = (1<<7) ; Channel D Compare or Capture Mode bit 1 mask
.equ TC4_CCDMODE1_bp = 7 ; Channel D Compare or Capture Mode bit 1 position
.equ TC4_CCCMODE_gm = 0x30 ; Channel C Compare or Capture Mode group mask
.equ TC4_CCCMODE_gp = 4 ; Channel C Compare or Capture Mode group position
.equ TC4_CCCMODE0_bm = (1<<4) ; Channel C Compare or Capture Mode bit 0 mask
.equ TC4_CCCMODE0_bp = 4 ; Channel C Compare or Capture Mode bit 0 position
.equ TC4_CCCMODE1_bm = (1<<5) ; Channel C Compare or Capture Mode bit 1 mask
.equ TC4_CCCMODE1_bp = 5 ; Channel C Compare or Capture Mode bit 1 position
.equ TC4_CCBMODE_gm = 0x0C ; Channel B Compare or Capture Mode group mask
.equ TC4_CCBMODE_gp = 2 ; Channel B Compare or Capture Mode group position
.equ TC4_CCBMODE0_bm = (1<<2) ; Channel B Compare or Capture Mode bit 0 mask
.equ TC4_CCBMODE0_bp = 2 ; Channel B Compare or Capture Mode bit 0 position
.equ TC4_CCBMODE1_bm = (1<<3) ; Channel B Compare or Capture Mode bit 1 mask
.equ TC4_CCBMODE1_bp = 3 ; Channel B Compare or Capture Mode bit 1 position
.equ TC4_CCAMODE_gm = 0x03 ; Channel A Compare or Capture Mode group mask
.equ TC4_CCAMODE_gp = 0 ; Channel A Compare or Capture Mode group position
.equ TC4_CCAMODE0_bm = (1<<0) ; Channel A Compare or Capture Mode bit 0 mask
.equ TC4_CCAMODE0_bp = 0 ; Channel A Compare or Capture Mode bit 0 position
.equ TC4_CCAMODE1_bm = (1<<1) ; Channel A Compare or Capture Mode bit 1 mask
.equ TC4_CCAMODE1_bp = 1 ; Channel A Compare or Capture Mode bit 1 position
.equ TC4_LCCDMODE_gm = 0xC0 ; Channel Low D Compare or Capture Mode group mask
.equ TC4_LCCDMODE_gp = 6 ; Channel Low D Compare or Capture Mode group position
.equ TC4_LCCDMODE0_bm = (1<<6) ; Channel Low D Compare or Capture Mode bit 0 mask
.equ TC4_LCCDMODE0_bp = 6 ; Channel Low D Compare or Capture Mode bit 0 position
.equ TC4_LCCDMODE1_bm = (1<<7) ; Channel Low D Compare or Capture Mode bit 1 mask
.equ TC4_LCCDMODE1_bp = 7 ; Channel Low D Compare or Capture Mode bit 1 position
.equ TC4_LCCCMODE_gm = 0x30 ; Channel Low C Compare or Capture Mode group mask
.equ TC4_LCCCMODE_gp = 4 ; Channel Low C Compare or Capture Mode group position
.equ TC4_LCCCMODE0_bm = (1<<4) ; Channel Low C Compare or Capture Mode bit 0 mask
.equ TC4_LCCCMODE0_bp = 4 ; Channel Low C Compare or Capture Mode bit 0 position
.equ TC4_LCCCMODE1_bm = (1<<5) ; Channel Low C Compare or Capture Mode bit 1 mask
.equ TC4_LCCCMODE1_bp = 5 ; Channel Low C Compare or Capture Mode bit 1 position
.equ TC4_LCCBMODE_gm = 0x0C ; Channel Low B Compare or Capture Mode group mask
.equ TC4_LCCBMODE_gp = 2 ; Channel Low B Compare or Capture Mode group position
.equ TC4_LCCBMODE0_bm = (1<<2) ; Channel Low B Compare or Capture Mode bit 0 mask
.equ TC4_LCCBMODE0_bp = 2 ; Channel Low B Compare or Capture Mode bit 0 position
.equ TC4_LCCBMODE1_bm = (1<<3) ; Channel Low B Compare or Capture Mode bit 1 mask
.equ TC4_LCCBMODE1_bp = 3 ; Channel Low B Compare or Capture Mode bit 1 position
.equ TC4_LCCAMODE_gm = 0x03 ; Channel Low A Compare or Capture Mode group mask
.equ TC4_LCCAMODE_gp = 0 ; Channel Low A Compare or Capture Mode group position
.equ TC4_LCCAMODE0_bm = (1<<0) ; Channel Low A Compare or Capture Mode bit 0 mask
.equ TC4_LCCAMODE0_bp = 0 ; Channel Low A Compare or Capture Mode bit 0 position
.equ TC4_LCCAMODE1_bm = (1<<1) ; Channel Low A Compare or Capture Mode bit 1 mask
.equ TC4_LCCAMODE1_bp = 1 ; Channel Low A Compare or Capture Mode bit 1 position

