trol73/avr-make/asm/include/ATxmega32E5def.inc
; TC4_CTRLGCLR masks
.equ TC4_STOP_bm = 0x10 ; Timer/Counter Stop bit mask
.equ TC4_STOP_bp = 4 ; Timer/Counter Stop bit position
.equ TC4_CMD_gm = 0x0C ; Command group mask
.equ TC4_CMD_gp = 2 ; Command group position
.equ TC4_CMD0_bm = (1<<2) ; Command bit 0 mask
.equ TC4_CMD0_bp = 2 ; Command bit 0 position
.equ TC4_CMD1_bm = (1<<3) ; Command bit 1 mask
.equ TC4_CMD1_bp = 3 ; Command bit 1 position
.equ TC4_LUPD_bm = 0x02 ; Lock Update bit mask
.equ TC4_LUPD_bp = 1 ; Lock Update bit position
.equ TC4_DIR_bm = 0x01 ; Counter Direction bit mask
.equ TC4_DIR_bp = 0 ; Counter Direction bit position

; TC4_CTRLGSET masks
; Masks for TC4_STOP already defined
; Masks for TC4_CMD already defined
; Masks for TC4_LUPD already defined
; Masks for TC4_DIR already defined

; TC4_CTRLHCLR masks
.equ TC4_CCDBV_bm = 0x10 ; Channel D Compare or Capture Buffer Valid bit mask
.equ TC4_CCDBV_bp = 4 ; Channel D Compare or Capture Buffer Valid bit position
.equ TC4_CCCBV_bm = 0x08 ; Channel C Compare or Capture Buffer Valid bit mask
.equ TC4_CCCBV_bp = 3 ; Channel C Compare or Capture Buffer Valid bit position
.equ TC4_CCBBV_bm = 0x04 ; Channel B Compare or Capture Buffer Valid bit mask
.equ TC4_CCBBV_bp = 2 ; Channel B Compare or Capture Buffer Valid bit position
.equ TC4_CCABV_bm = 0x02 ; Channel A Compare or Capture Buffer Valid bit mask
.equ TC4_CCABV_bp = 1 ; Channel A Compare or Capture Buffer Valid bit position
.equ TC4_PERBV_bm = 0x01 ; Period Buffer Valid bit mask
.equ TC4_PERBV_bp = 0 ; Period Buffer Valid bit position
.equ TC4_LCCDBV_bm = 0x10 ; Channel Low D Compare or Capture Buffer Valid bit mask
.equ TC4_LCCDBV_bp = 4 ; Channel Low D Compare or Capture Buffer Valid bit position
.equ TC4_LCCCBV_bm = 0x08 ; Channel Low C Compare or Capture Buffer Valid bit mask
.equ TC4_LCCCBV_bp = 3 ; Channel Low C Compare or Capture Buffer Valid bit position
.equ TC4_LCCBBV_bm = 0x04 ; Channel Low B Compare or Capture Buffer Valid bit mask
.equ TC4_LCCBBV_bp = 2 ; Channel Low B Compare or Capture Buffer Valid bit position
.equ TC4_LCCABV_bm = 0x02 ; Channel Low A Compare or Capture Buffer Valid bit mask
.equ TC4_LCCABV_bp = 1 ; Channel Low A Compare or Capture Buffer Valid bit position
.equ TC4_LPERBV_bm = 0x01 ; Period Low Buffer Valid bit mask
.equ TC4_LPERBV_bp = 0 ; Period Low Buffer Valid bit position

; TC4_CTRLHSET masks
; Masks for TC4_CCDBV already defined
; Masks for TC4_CCCBV already defined
; Masks for TC4_CCBBV already defined
; Masks for TC4_CCABV already defined
; Masks for TC4_PERBV already defined
; Masks for TC4_LCCDBV already defined
; Masks for TC4_LCCCBV already defined
; Masks for TC4_LCCBBV already defined
; Masks for TC4_LCCABV already defined
; Masks for TC4_LPERBV already defined

; TC4_INTFLAGS masks
.equ TC4_CCDIF_bm = 0x80 ; Channel D Compare or Capture Interrupt Flag bit mask
.equ TC4_CCDIF_bp = 7 ; Channel D Compare or Capture Interrupt Flag bit position
.equ TC4_CCCIF_bm = 0x40 ; Channel C Compare or Capture Interrupt Flag bit mask
.equ TC4_CCCIF_bp = 6 ; Channel C Compare or Capture Interrupt Flag bit position
.equ TC4_CCBIF_bm = 0x20 ; Channel B Compare or Capture Interrupt Flag bit mask
.equ TC4_CCBIF_bp = 5 ; Channel B Compare or Capture Interrupt Flag bit position
.equ TC4_CCAIF_bm = 0x10 ; Channel A Compare or Capture Interrupt Flag bit mask
.equ TC4_CCAIF_bp = 4 ; Channel A Compare or Capture Interrupt Flag bit position
.equ TC4_TRGIF_bm = 0x04 ; Trigger Restart Interrupt Flag bit mask
.equ TC4_TRGIF_bp = 2 ; Trigger Restart Interrupt Flag bit position
.equ TC4_ERRIF_bm = 0x02 ; Error Interrupt Flag bit mask
.equ TC4_ERRIF_bp = 1 ; Error Interrupt Flag bit position
.equ TC4_OVFIF_bm = 0x01 ; Overflow/Underflow Interrupt Flag bit mask
.equ TC4_OVFIF_bp = 0 ; Overflow/Underflow Interrupt Flag bit position
.equ TC4_LCCDIF_bm = 0x80 ; Channel Low D Compare or Capture Interrupt Flag bit mask
.equ TC4_LCCDIF_bp = 7 ; Channel Low D Compare or Capture Interrupt Flag bit position
.equ TC4_LCCCIF_bm = 0x40 ; Channel Low C Compare or Capture Interrupt Flag bit mask
.equ TC4_LCCCIF_bp = 6 ; Channel Low C Compare or Capture Interrupt Flag bit position
.equ TC4_LCCBIF_bm = 0x20 ; Channel Low B Compare or Capture Interrupt Flag bit mask
.equ TC4_LCCBIF_bp = 5 ; Channel Low B Compare or Capture Interrupt Flag bit position
.equ TC4_LCCAIF_bm = 0x10 ; Channel Low A Compare or Capture Interrupt Flag bit mask
.equ TC4_LCCAIF_bp = 4 ; Channel Low A Compare or Capture Interrupt Flag bit position

; TC5_CTRLA masks
.equ TC5_SYNCHEN_bm = 0x40 ; Synchronization Enabled bit mask
.equ TC5_SYNCHEN_bp = 6 ; Synchronization Enabled bit position
.equ TC5_EVSTART_bm = 0x20 ; Start on Next Event bit mask
.equ TC5_EVSTART_bp = 5 ; Start on Next Event bit position
.equ TC5_UPSTOP_bm = 0x10 ; Stop on Next Update bit mask
.equ TC5_UPSTOP_bp = 4 ; Stop on Next Update bit position
.equ TC5_CLKSEL_gm = 0x0F ; Clock Select group mask
.equ TC5_CLKSEL_gp = 0 ; Clock Select group position
.equ TC5_CLKSEL0_bm = (1<<0) ; Clock Select bit 0 mask
.equ TC5_CLKSEL0_bp = 0 ; Clock Select bit 0 position
.equ TC5_CLKSEL1_bm = (1<<1) ; Clock Select bit 1 mask
.equ TC5_CLKSEL1_bp = 1 ; Clock Select bit 1 position
.equ TC5_CLKSEL2_bm = (1<<2) ; Clock Select bit 2 mask
.equ TC5_CLKSEL2_bp = 2 ; Clock Select bit 2 position
.equ TC5_CLKSEL3_bm = (1<<3) ; Clock Select bit 3 mask
.equ TC5_CLKSEL3_bp = 3 ; Clock Select bit 3 position

; TC5_CTRLB masks
.equ TC5_BYTEM_gm = 0xC0 ; Byte Mode group mask
.equ TC5_BYTEM_gp = 6 ; Byte Mode group position
.equ TC5_BYTEM0_bm = (1<<6) ; Byte Mode bit 0 mask
.equ TC5_BYTEM0_bp = 6 ; Byte Mode bit 0 position
.equ TC5_BYTEM1_bm = (1<<7) ; Byte Mode bit 1 mask
.equ TC5_BYTEM1_bp = 7 ; Byte Mode bit 1 position
.equ TC5_CIRCEN_gm = 0x30 ; Circular Buffer Enable group mask
.equ TC5_CIRCEN_gp = 4 ; Circular Buffer Enable group position
.equ TC5_CIRCEN0_bm = (1<<4) ; Circular Buffer Enable bit 0 mask
.equ TC5_CIRCEN0_bp = 4 ; Circular Buffer Enable bit 0 position
.equ TC5_CIRCEN1_bm = (1<<5) ; Circular Buffer Enable bit 1 mask
.equ TC5_CIRCEN1_bp = 5 ; Circular Buffer Enable bit 1 position
.equ TC5_WGMODE_gm = 0x07 ; Waveform Generation Mode group mask
.equ TC5_WGMODE_gp = 0 ; Waveform Generation Mode group position
.equ TC5_WGMODE0_bm = (1<<0) ; Waveform Generation Mode bit 0 mask
.equ TC5_WGMODE0_bp = 0 ; Waveform Generation Mode bit 0 position
.equ TC5_WGMODE1_bm = (1<<1) ; Waveform Generation Mode bit 1 mask
.equ TC5_WGMODE1_bp = 1 ; Waveform Generation Mode bit 1 position
.equ TC5_WGMODE2_bm = (1<<2) ; Waveform Generation Mode bit 2 mask
.equ TC5_WGMODE2_bp = 2 ; Waveform Generation Mode bit 2 position

; TC5_CTRLC masks
.equ TC5_POLB_bm = 0x20 ; Channel B Output Polarity bit mask
.equ TC5_POLB_bp = 5 ; Channel B Output Polarity bit position
.equ TC5_POLA_bm = 0x10 ; Channel A Output Polarity bit mask
.equ TC5_POLA_bp = 4 ; Channel A Output Polarity bit position
.equ TC5_CMPB_bm = 0x02 ; Channel B Compare Output Value bit mask
.equ TC5_CMPB_bp = 1 ; Channel B Compare Output Value bit position
.equ TC5_CMPA_bm = 0x01 ; Channel A Compare Output Value bit mask
.equ TC5_CMPA_bp = 0 ; Channel A Compare Output Value bit position
.equ TC5_HCMPB_bm = 0x20 ; High Channel B Compare Output Value bit mask
.equ TC5_HCMPB_bp = 5 ; High Channel B Compare Output Value bit position
.equ TC5_HCMPA_bm = 0x10 ; High Channel A Compare Output Value bit mask
.equ TC5_HCMPA_bp = 4 ; High Channel A Compare Output Value bit position
.equ TC5_LCMPB_bm = 0x02 ; Low Channel B Compare Output Value bit mask
.equ TC5_LCMPB_bp = 1 ; Low Channel B Compare Output Value bit position
.equ TC5_LCMPA_bm = 0x01 ; Low Channel A Compare Output Value bit mask
.equ TC5_LCMPA_bp = 0 ; Low Channel A Compare Output Value bit position

