trol73/avr-make/asm/include/ATxmega32E5def.inc
; TC5_CTRLHCLR masks
.equ TC5_CCBBV_bm = 0x04 ; Channel B Compare or Capture Buffer Valid bit mask
.equ TC5_CCBBV_bp = 2 ; Channel B Compare or Capture Buffer Valid bit position
.equ TC5_CCABV_bm = 0x02 ; Channel A Compare or Capture Buffer Valid bit mask
.equ TC5_CCABV_bp = 1 ; Channel A Compare or Capture Buffer Valid bit position
.equ TC5_PERBV_bm = 0x01 ; Period Buffer Valid bit mask
.equ TC5_PERBV_bp = 0 ; Period Buffer Valid bit position
.equ TC5_LCCBBV_bm = 0x04 ; Channel Low B Compare or Capture Buffer Valid bit mask
.equ TC5_LCCBBV_bp = 2 ; Channel Low B Compare or Capture Buffer Valid bit position
.equ TC5_LCCABV_bm = 0x02 ; Channel Low A Compare or Capture Buffer Valid bit mask
.equ TC5_LCCABV_bp = 1 ; Channel Low A Compare or Capture Buffer Valid bit position
.equ TC5_LPERBV_bm = 0x01 ; Period Low Buffer Valid bit mask
.equ TC5_LPERBV_bp = 0 ; Period Low Buffer Valid bit position

; TC5_CTRLHSET masks
; Masks for TC5_CCBBV already defined
; Masks for TC5_CCABV already defined
; Masks for TC5_PERBV already defined
; Masks for TC5_LCCBBV already defined
; Masks for TC5_LCCABV already defined
; Masks for TC5_LPERBV already defined

; TC5_INTFLAGS masks
.equ TC5_CCBIF_bm = 0x20 ; Channel B Compare or Capture Interrupt Flag bit mask
.equ TC5_CCBIF_bp = 5 ; Channel B Compare or Capture Interrupt Flag bit position
.equ TC5_CCAIF_bm = 0x10 ; Channel A Compare or Capture Interrupt Flag bit mask
.equ TC5_CCAIF_bp = 4 ; Channel A Compare or Capture Interrupt Flag bit position
.equ TC5_TRGIF_bm = 0x04 ; Trigger Restart Interrupt Flag bit mask
.equ TC5_TRGIF_bp = 2 ; Trigger Restart Interrupt Flag bit position
.equ TC5_ERRIF_bm = 0x02 ; Error Interrupt Flag bit mask
.equ TC5_ERRIF_bp = 1 ; Error Interrupt Flag bit position
.equ TC5_OVFIF_bm = 0x01 ; Overflow/Underflow Interrupt Flag bit mask
.equ TC5_OVFIF_bp = 0 ; Overflow/Underflow Interrupt Flag bit position
.equ TC5_LCCBIF_bm = 0x20 ; Channel Low B Compare or Capture Interrupt Flag bit mask
.equ TC5_LCCBIF_bp = 5 ; Channel Low B Compare or Capture Interrupt Flag bit position
.equ TC5_LCCAIF_bm = 0x10 ; Channel Low A Compare or Capture Interrupt Flag bit mask
.equ TC5_LCCAIF_bp = 4 ; Channel Low A Compare or Capture Interrupt Flag bit position

; Clock Selection
.equ TC45_CLKSEL_OFF_gc = (0x00<<0) ; Timer Off
.equ TC45_CLKSEL_DIV1_gc = (0x01<<0) ; System Clock
.equ TC45_CLKSEL_DIV2_gc = (0x02<<0) ; System Clock / 2
.equ TC45_CLKSEL_DIV4_gc = (0x03<<0) ; System Clock / 4
.equ TC45_CLKSEL_DIV8_gc = (0x04<<0) ; System Clock / 8
.equ TC45_CLKSEL_DIV64_gc = (0x05<<0) ; System Clock / 64
.equ TC45_CLKSEL_DIV256_gc = (0x06<<0) ; System Clock / 256
.equ TC45_CLKSEL_DIV1024_gc = (0x07<<0) ; System Clock / 1024
.equ TC45_CLKSEL_EVCH0_gc = (0x08<<0) ; Event Channel 0
.equ TC45_CLKSEL_EVCH1_gc = (0x09<<0) ; Event Channel 1
.equ TC45_CLKSEL_EVCH2_gc = (0x0A<<0) ; Event Channel 2
.equ TC45_CLKSEL_EVCH3_gc = (0x0B<<0) ; Event Channel 3
.equ TC45_CLKSEL_EVCH4_gc = (0x0C<<0) ; Event Channel 4
.equ TC45_CLKSEL_EVCH5_gc = (0x0D<<0) ; Event Channel 5
.equ TC45_CLKSEL_EVCH6_gc = (0x0E<<0) ; Event Channel 6
.equ TC45_CLKSEL_EVCH7_gc = (0x0F<<0) ; Event Channel 7

; Byte Mode
.equ TC45_BYTEM_NORMAL_gc = (0x00<<6) ; 16-bit mode
.equ TC45_BYTEM_BYTEMODE_gc = (0x01<<6) ; Timer/Counter Operating in Byte Mode Only

; Circular Enable Mode
.equ TC45_CIRCEN_DISABLE_gc = (0x00<<4) ; Circular Buffer Disabled
.equ TC45_CIRCEN_PER_gc = (0x01<<4) ; Circular Buffer Enabled on PER/PERBUF
.equ TC45_CIRCEN_CCA_gc = (0x02<<4) ; Circular Buffer Enabled on CCA/CCABUF
.equ TC45_CIRCEN_BOTH_gc = (0x03<<4) ; Circular Buffer Enabled on All Buffered Registers

; Waveform Generation Mode
.equ TC45_WGMODE_NORMAL_gc = (0x00<<0) ; Normal Mode
.equ TC45_WGMODE_FRQ_gc = (0x01<<0) ; Frequency Generation Mode
.equ TC45_WGMODE_SINGLESLOPE_gc = (0x03<<0) ; Single Slope
.equ TC45_WGMODE_DSTOP_gc = (0x05<<0) ; Dual Slope, Update on TOP
.equ TC45_WGMODE_DSBOTH_gc = (0x06<<0) ; Dual Slope, Both
.equ TC45_WGMODE_DSBOTTOM_gc = (0x07<<0) ; Dual Slope, Update on BOTTOM

; Event Action
.equ TC45_EVACT_OFF_gc = (0x00<<5) ; No Event Action
.equ TC45_EVACT_FMODE1_gc = (0x01<<5) ; Fault Mode 1 capture
.equ TC45_EVACT_FMODE2_gc = (0x02<<5) ; Fault Mode 2 capture
.equ TC45_EVACT_UPDOWN_gc = (0x03<<5) ; Up/down count
.equ TC45_EVACT_QDEC_gc = (0x04<<5) ; Quadrature decode
.equ TC45_EVACT_RESTART_gc = (0x05<<5) ; Restart
.equ TC45_EVACT_PWF_gc = (0x06<<5) ; Pulse-width Capture

; Event Selection
.equ TC45_EVSEL_OFF_gc = (0x00<<0) ; No Event Source
.equ TC45_EVSEL_CH0_gc = (0x08<<0) ; Event Channel 0
.equ TC45_EVSEL_CH1_gc = (0x09<<0) ; Event Channel 1
.equ TC45_EVSEL_CH2_gc = (0x0A<<0) ; Event Channel 2
.equ TC45_EVSEL_CH3_gc = (0x0B<<0) ; Event Channel 3
.equ TC45_EVSEL_CH4_gc = (0x0C<<0) ; Event Channel 4
.equ TC45_EVSEL_CH5_gc = (0x0D<<0) ; Event Channel 5
.equ TC45_EVSEL_CH6_gc = (0x0E<<0) ; Event Channel 6
.equ TC45_EVSEL_CH7_gc = (0x0F<<0) ; Event Channel 7

; Compare or Capture Channel A Mode
.equ TC45_CCAMODE_DISABLE_gc = (0x00<<0) ; Channel Disabled
.equ TC45_CCAMODE_COMP_gc = (0x01<<0) ; Ouput Compare enabled
.equ TC45_CCAMODE_CAPT_gc = (0x02<<0) ; Input Capture enabled
.equ TC45_CCAMODE_BOTHCC_gc = (0x03<<0) ; Both Compare and Capture enabled

; Compare or Capture Channel B Mode
.equ TC45_CCBMODE_DISABLE_gc = (0x00<<2) ; Channel Disabled
.equ TC45_CCBMODE_COMP_gc = (0x01<<2) ; Ouput Compare enabled
.equ TC45_CCBMODE_CAPT_gc = (0x02<<2) ; Input Capture enabled
.equ TC45_CCBMODE_BOTHCC_gc = (0x03<<2) ; Both Compare and Capture enabled

; Compare or Capture Channel C Mode
.equ TC45_CCCMODE_DISABLE_gc = (0x00<<4) ; Channel Disabled
.equ TC45_CCCMODE_COMP_gc = (0x01<<4) ; Ouput Compare enabled
.equ TC45_CCCMODE_CAPT_gc = (0x02<<4) ; Input Capture enabled
.equ TC45_CCCMODE_BOTHCC_gc = (0x03<<4) ; Both Compare and Capture enabled

; Compare or Capture Channel D Mode
.equ TC45_CCDMODE_DISABLE_gc = (0x00<<6) ; Channel Disabled
.equ TC45_CCDMODE_COMP_gc = (0x01<<6) ; Ouput Compare enabled
.equ TC45_CCDMODE_CAPT_gc = (0x02<<6) ; Input Capture enabled
.equ TC45_CCDMODE_BOTHCC_gc = (0x03<<6) ; Both Compare and Capture enabled

; Compare or Capture Low Channel A Mode
.equ TC45_LCCAMODE_DISABLE_gc = (0x00<<0) ; Channel Disabled
.equ TC45_LCCAMODE_COMP_gc = (0x01<<0) ; Ouput Compare enabled
.equ TC45_LCCAMODE_CAPT_gc = (0x02<<0) ; Input Capture enabled
.equ TC45_LCCAMODE_BOTHCC_gc = (0x03<<0) ; Both Compare and Capture enabled

; Compare or Capture Low Channel B Mode
.equ TC45_LCCBMODE_DISABLE_gc = (0x00<<2) ; Channel Disabled
.equ TC45_LCCBMODE_COMP_gc = (0x01<<2) ; Ouput Compare enabled
.equ TC45_LCCBMODE_CAPT_gc = (0x02<<2) ; Input Capture enabled
.equ TC45_LCCBMODE_BOTHCC_gc = (0x03<<2) ; Both Compare and Capture enabled

